[
  {
    "heading": "Cemeteries",
    "text": "Arrange for the burial of your loved ones at a City cemetery. ",
    "pdfs": []
  },
  {
    "heading": "Active cemeteries",
    "text": "We manage six cemeteries in Kingston. Pine Grove Cemetery, located at 3645 Brewers Mills Rd. in Seeley’s Bay, is the only active cemetery in operation. Burial rights are for sale and can occur at this location. For cemetery sales and administration contact the Cemeteries Operator at 613-546-4291 ext. 1276 or cemeteries@cityofkingston.ca . Cemetery fees Interment (burial) rights * All fees are subject to HST. Fees came into effect on January 1, 2026. ** One burial and up to three cremated human remains, or up to four cremated human remains per plot. *** This fee includes the required one-time 40% care & maintenance charge. This equals $546.36. Markers (monuments) These are the charges for care & maintenance of markers (monuments). Marker sizes 1 A small marker is less than 173 square inches 2 A large marker is 173 square inches or more 3 A small upright marker is four feet or less in either height or length, including the base 4 A large upright marker is more than four feet in either height or length, including the base License information In total, we operate six cemeteries under the Bereavement Authority of Ontario (BAO). Our license number is 3348757. Purchasers of interment rights have various options, rights and responsibilities. Review these in the Funeral, Burial and Cremation Services Act, 2002 before entering into a contract with a licensed organization.  The Consumer Information Guide on the BAO website provides more information. ",
    "pdfs": []
  },
  {
    "heading": "Green burials",
    "text": "A Green burial is an environmentally sensitive practice where the body is returned to the earth to decompose naturally and contribute to environmental renewal. The Green Burial Society of Canada outlines five important considerations for green burials. ",
    "pdfs": []
  },
  {
    "heading": "Green burials in Kingston",
    "text": "Green burials are available at Pine Grove Cemetery. Your loved one will be buried in a shared green burial area, separate from regular burial sites. Each person will have a unique spot marked only by a number. You can also have their name included on a shared memorial. In each green burial plot, you can have one of the following: Caskets or containers must use natural materials like wood, wicker, recycled cardboard or natural fibres. They shouldn't have non-biodegradable materials except for a few small pieces like hinges or screws. Chemicals like formaldehyde or other non-biodegradable substances are not permitted. After the burial, the ground will settle over time. Workers will then seed native plants over the burial site. If you’re considering a green burial, work with funeral service providers who understand these requirements. Many local funeral homes can help prepare for green burials. Visit one of these websites to learn more about green burials, rituals and services. ",
    "pdfs": []
  },
  {
    "heading": "Cemetery guidelines",
    "text": "Review our Cemetery Bylaw for the full guidelines. Contact City's Clerk Department cityclerk@cityofkingston.ca Phone: 613-546-4291 ext. 1207 The City of Kingston acknowledges that we are on the traditional homeland of the Anishinabek, Haudenosaunee, and the Huron-Wendat, and thanks these nations for their care and stewardship over this shared land. Today, the City is committed to working with Indigenous peoples and all residents to pursue a united path of reconciliation. Learn more about the City's reconciliation initiatives . ",
    "pdfs": []
  }
]