[
  {
    "heading": "Commissioner of Oaths",
    "text": "A Commissioner of Oaths in Ontario has the authority to administer oaths when you sign an affidavit or statutory declaration. The Province of Ontario grants them this authority through the Commissioners for Taking Affidavits Act . It's important to note that the Commissioner is not responsible for the content of the affidavit. ",
    "pdfs": []
  },
  {
    "heading": "Need to take an oath?",
    "text": "It is not guaranteed that a document can be commissioned until the Commissioner has viewed it. If you would like to be sure, please email vitalstatistics@cityofkingston.ca with a copy of the document for review. Note: Documents not in English must be translated by a certified translator at your expense before they can be commissioned. To take an oath: The cost for this service is $44 ($22 for eligible residents on the Municipal Fee Assistance Program). You can pay with cash, a money order, Interac, Visa, MasterCard, or American Express. ",
    "pdfs": []
  },
  {
    "heading": "Your responsibility",
    "text": "If you must sign a legal document that requires you to swear it is true, remember, you are the one responsible for what's written in it. When you swear it is true, you are called the \"deponent.\" Your signature confirms that everything in the paper is correct. As a deponent, you should understand what's in the paper and know that you're saying it's all true when you swear to it. ",
    "pdfs": []
  },
  {
    "heading": "Documents that can be signed",
    "text": "Whether the Commissioner of Oaths chooses to sign a document is entirely up to their discretion. If the Commissioner of Oaths has any doubts about the identity of the person making the declaration or the content of the document for any reason, they may decline to sign it, and the person making the declaration would be advised to consult a lawyer. If you would like to be sure, please email vitalstatistics@cityofkingston.ca with a copy of the document for review. ",
    "pdfs": []
  },
  {
    "heading": "Commissioner of Oaths and a Notary Public",
    "text": "There are certain documents that a Commissioner of Oaths cannot sign. It is important to understand the difference between a Commissioner of Oaths and a Notary Public. A Commissioner of Oaths is not the same as a Notary Public. If you need a document to be \"notarized\" instead of \"commissioned,\" you should seek a Notary Public, who is typically a lawyer and not a Commissioner of Oaths. We do not have a Notary Public. A Notary Public is authorized under the Notaries Act to handle various tasks, such as commissioning documents, certifying or notarizing documents as true copies, and verifying signatures. Becoming a Notary Public involves stricter requirements compared to becoming a commissioner, and most public notaries are lawyers or judicial officers. Documents that can be commissioned include, but are not limited to: Documents that will not be commissioned include, but are not limited to: Documents that may require a Notary Public Contact City Hall Payment Centre 1st Floor, City Hall 216 Ontario St. Kingston, ON K7L 2Z3 Phone: 613-546-4291 ext. 1270 Hours: Monday to Friday 8:30 a.m. to 4:30 p.m. The City of Kingston acknowledges that we are on the traditional homeland of the Anishinabek, Haudenosaunee, and the Huron-Wendat, and thanks these nations for their care and stewardship over this shared land. Today, the City is committed to working with Indigenous peoples and all residents to pursue a united path of reconciliation. Learn more about the City's reconciliation initiatives . ",
    "pdfs": []
  }
]