[
  {
    "heading": "Food Truck Permits",
    "text": "Starting a business as a food vendor can be an exciting venture! To operate a food stand which includes a mobile or immobile structure, vehicle, cart or kiosk you must have a licence to sell food and beverages in the city. Check the Starting a Business page to learn about the process of applying for a business license. ",
    "pdfs": []
  },
  {
    "heading": "Apply for a food vendor/food stand licence",
    "text": "Sign up/log in to MyKingston to complete your application online and ensure we can fulfill your request effectively. Require an alternate format? You can Contact Us . Apply now ",
    "pdfs": []
  },
  {
    "heading": "Park vendor permits",
    "text": "Community spaces, such as parks, are important gathering places. The food and drinks available in community spaces can impact the health of the residents. By having healthy options readily available, you can help shape positive eating habits. Please review our Park Refreshment Vehicle Policy . We evaluate all applications as outlined in this policy. The Park Refreshment Vehicle Policy promotes and prioritizes vendors who: ",
    "pdfs": []
  },
  {
    "heading": "Application timeline",
    "text": "We accept applications year-round, we grant permits in April to the top-scoring applicants who submit their applications in March. ",
    "pdfs": []
  },
  {
    "heading": "Review process",
    "text": "Assignments are not based on a first-come, first-served basis. Instead, applications will be scored, considering the availability of healthy options on your menu. For information on healthy options, please visit Canada's Food Guide . We are committed to supporting the food industry while maintaining business standards and regulating the Refreshment Vehicle Industry for health, safety, and public well-being. Our Licensing Team and Public Health Dietician Team will review the Healthy Food Scoring Form to ensure it meets the standards, requirements, and qualifications of the Healthy Food framework. ",
    "pdfs": []
  },
  {
    "heading": "Permits and designated locations",
    "text": "We offer monthly and annual permits, and they are available for the following locations: Note: Please review the application for the number and type of sites available at each location. Other locations may be considered upon request. Contact Licensing and Enforcement 1211 John Counter Blvd. Kingston, On K7K 6C7 licensingapplications @cityofkingston.ca Phone: 613-546-4291 ext. 3150 The City of Kingston acknowledges that we are on the traditional homeland of the Anishinabek, Haudenosaunee, and the Huron-Wendat, and thanks these nations for their care and stewardship over this shared land. Today, the City is committed to working with Indigenous peoples and all residents to pursue a united path of reconciliation. Learn more about the City's reconciliation initiatives . ",
    "pdfs": []
  }
]