[
  {
    "heading": "Parking Permits",
    "text": "On-street parking permits help ensure that residential streets are not clogged with commuter parking. They allow us to manage parking in the downtown area to ensure that available street parking is used effectively and fairly, so there are no negative impacts on downtown neighbourhoods. You cannot park without a permit in permit zones from Monday to Friday during the posted time restrictions as posted on the street. No permit or exemption is needed to park on those streets outside those restricted time periods. Parking permits do not allow permit holders to park on the street when a winter parking ban is in place. Interested in a parking permit for a lot? Visit our Parking Lots and Garages page for more information. ",
    "pdfs": []
  },
  {
    "heading": "Apply for a permit",
    "text": "We offer a variety of parking permits to accommodate your needs. Under the permit you want, use the form link to complete an online application. Commuter parking permit Commuter permits are for people who work downtown and want to park in certain areas, even when there are time restrictions. The cost varies from $109.25 to $130.50. The price depends on how close you are to places that require a lot of parking, like schools, hospitals or businesses. A commuter permit allows you to park for a maximum of 12 hours per day. Note: Commuter parking permits are limited to passenger vehicles as per the Parking Bylaw. We do not guarantee a dedicated parking space, only the ability to park in available spaces. Remember to follow the Winter Parking restrictions. Residential parking permit Residential permits are for people who live in the central part of the city and want to park on the street, even when there are time restrictions. The cost is $25 a month, tax included. If you live in a place without a driveway, you may qualify for the discounted rate of $12 a month, tax included. A residential permit allows you to park for up to 72 hours. You must move your vehicle every 72 hours. Note: Residential parking permits are limited to passenger vehicles as per the Parking Bylaw. We do not guarantee a dedicated parking space, only the ability to park in available spaces. Residential accessible parking permit Residential accessible parking permits are available to residents who have a provincially issued accessible parking permit, but do not have any parking space at their home. It allows people who live in a downtown permit zone to park on the street, even when there are time restrictions. The cost is $12 a month, tax included plus an administrative fee to cover the costs of the sign/s installation. A residential permit allows you to park for up to 72 hours. You must move your vehicle every 72 hours. Note: Residential accessible parking permits are limited to passenger vehicles as per the Parking Bylaw. Residential contractor parking permit A residential contractor permit allows contractors to park on the street by your property for periods exceeding two weeks. For contractor parking lasting less than two weeks, request a temporary permit. For contractor parking for just one day, request a parking exemption. The cost varies depending on how long you need the permit: A residential contractor permit allows the contractor to park for up to 12 hours and is valid for a single vehicle and trailer. Temporary parking permit Residents with visitors or contractors at their home for more than 1 day can apply for a temporary parking permit. However, if you only need parking for one day, simply request a parking exemption. To get a temporary permit, fill out the application form and submit it at least 2 business days before the date you need it. The cost is $15.50, tax included. A temporary permit allows you to park for up to 72 hours. You must move your vehicle every 72 hours. We grant permits for seven consecutive days with a limit of one renewal. If you need parking extended beyond this period, we may provide additional renewals on a case-by-case basis. If you require parking access for longer than seven days, request a residential contractor parking permit. Note: We do not guarantee a dedicated parking space, only the ability to park in available spaces. Remember to follow the Winter Parking restrictions. ",
    "pdfs": [
      {
        "text": "Commuter Parking Permit Form",
        "url": "https://www.cityofkingston.ca/media/tmon3c0w/parking_commuter-parking-permit.pdf"
      },
      {
        "text": "Residential Accessible Parking Permit Form",
        "url": "https://www.cityofkingston.ca/media/tmon3c0w/parking_commuter-parking-permit.pdf"
      },
      {
        "text": "Temporary Parking Permit Form",
        "url": "https://www.cityofkingston.ca/media/tmon3c0w/parking_commuter-parking-permit.pdf"
      }
    ]
  },
  {
    "heading": "Renew your parking permit",
    "text": "If your parking permit is about to expire, but is still valid, you can renew it online. If your permit has already expired, you must renew it in-person at City Hall. Renew parking permit ",
    "pdfs": []
  },
  {
    "heading": "Parking permit areas",
    "text": "Review our parking permit areas map. Open the full page Parking Permits Areas map . ",
    "pdfs": []
  },
  {
    "heading": "Parking permit rates",
    "text": "Area A - Sydenham District and Hotel Dieu Hospital Area Weekly: $15.50 Single day: No charge Area B - Queen’s University/ Kingston General Hospital/Williamsville area Weekly: $15.50 Single day: No charge Zone B1 and B2: $109.25 Zone B3 and B4: $130.50 Zone B5 and B6: $130.50 Zone B7 (carpool permit): $130.50 Area C - Inner Harbour Neighbourhood Weekly: $15.50 Single day: No charge Area F - Williamsville North Neighbourhood Weekly: $15.50 Single day: No charge Work for Queens University or Kingston General Hospital? The Queen's University and Kingston General Hospital (KGH) area has excellent public transit service! Kingston Transit offers express routes running frequently during peak times. Commuters, explore transit options with our transit trip planner . Employees at Queen's, Kingston General Hospital, and Aramark can get discounted monthly transit passes through Kingston Transit's Employer Transpass program . Queen's University parking offers monthly parking options in campus lots for both Queen's and KGH employees. Work for Rideaucrest or Empire Life? Area C benefits from excellent Kingston Transit service, offering park and ride and commuting options. Kingston Transit express routes running frequently during peak times. Commuters, explore transit options with our transit trip planner . Businesses within and around Area C can access discounted monthly transit passes via Kingston Transit's Employer Transpass program . Contact Us City of Kingston City Hall 216 Ontario Street Kingston, ON K7L 2Z3 Canada contactus@cityofkingston.ca Phone: 613-546-0000 The City of Kingston acknowledges that we are on the traditional homeland of the Anishinabek, Haudenosaunee, and the Huron-Wendat, and thanks these nations for their care and stewardship over this shared land. Today, the City is committed to working with Indigenous peoples and all residents to pursue a united path of reconciliation. Learn more about the City's reconciliation initiatives . ",
    "pdfs": []
  },
  {
    "heading": "Parking Permits Areas Map",
    "text": "The City of Kingston acknowledges that we are on the traditional homeland of the Anishinabek, Haudenosaunee, and the Huron-Wendat, and thanks these nations for their care and stewardship over this shared land. Today, the City is committed to working with Indigenous peoples and all residents to pursue a united path of reconciliation. Learn more about the City's reconciliation initiatives . ",
    "pdfs": []
  }
]