[
  {
    "heading": "Right-of-Way Permits",
    "text": "The right-of-way is a City-owned section in front of a resident's property. It includes the roadway, utilities and sidewalks. The distance varies depending on the location and type of roadway. If you are planning a project that involves the right-of-way, you may need to apply for a permit. ",
    "pdfs": []
  },
  {
    "heading": "Driveway/entranceway permit",
    "text": "You need a permit to install or alter a driveway within the municipal right-of-way. If alterations match the current conditions of your existing driveway and don't change the size or layout, such as when you're repaving, you do not need a permit. Sign in to or create a MyKingston account to easily apply for Driveway/entranceway permit online. Terms and conditions 1.    Any driveway and/or driveway widening shall comply with any, and all applicable Zoning By- laws and connect directly to a designated parking spot within the private property, as defined by the applicable Zoning By-Law. 2.    Allocation of vehicle parking can only be provided within private property. Parking of vehicles is not permitted within the City’s right-of-way. 3.    The driveway is located at least 7.62 m from an intersection(s). 4.    Entranceways and driveways works, including culvert installations, shall be in accordance with OPSD301.010, OPSD 301.020 & OPSD 301.030, as applicable to the work and all applicable City of Kingston Standards and Specifications. 5.    All entrance culverts are to be constructed of corrugated steel (OPSS.MUNI 1801) or PVC (OPSS.MUNI 1841). 6.    Entrance culverts cannot be located closer than 4.57 m from cross-culverts under City streets. 7.    The City of Kingston is not obligated to install a ditch for the purpose of draining private lands. The City will not be held liable for any flooding or water back-up to private lands which may be caused by existing drainage conditions. The City also obtains the right to object to any private drains being located on the City right-of-way. 8.    The City of Kingston reserves the right to terminate a permit at any time. 9.    All commercial entrances must be paved to the City of Kingston right-of-way limit. 10.    No head walls will be permitted on the City of Kingston right-of-way limit. 11.    Culvert lengths and diameters will vary to conform to existing conditions. 12.    The City of Kingston cannot be held liable for safety issues relating to the entrance. 13.    The applicant is responsible for all associated costs pertaining to the City of Kingston right-of- way. 14.    The Contractor covenants and agrees to ensure that its employees, agents, and subcontractors and those for whom the Contractor is responsible at law perform all work permitted by this PERMIT in accordance with all codes, laws (including the Occupational Health and Safety Act R.S.O. 1990, c. O.1 and its regulations (the “OHSA”) and the Highway Traffic Act, R.S.O. 1990, c. H.8 and its regulations (“HTA”)), by-laws, rules, regulations and codes prescribed by all governmental or other authorities having jurisdiction. 15.    Except as otherwise agreed by a City permit, unrestricted access must be maintained to all service corridors, sidewalks, roads, entrances, parking facilities, utilities, transit stops, fire hydrants and building fire connections (siamese), gas assets or gas meters, light standards, signals, utility values, chambers and pedestals, maintenance-holes, street furniture, etc. Traffic Control 1.    Right-of-way conditions for the subject project shall be maintained as per the submitted Traffic Control Plan. It remains the contractor’s sole responsibility to ensure that any and all traffic control devices i.e. barricades, barrels, signage, etc. are installed and maintained for the duration of the right-of-way activity, all in compliance with OTM Book 7, Temporary Conditions. ",
    "pdfs": []
  },
  {
    "heading": "Excess load annual permit",
    "text": "An Oversize/Overweight Annual Permit (O/O Annual) allows for the hauling of oversize/overweight loads during the period permitted, as defined by the Highway Traffic Act (HTA), that are within the specified maximum weights and dimensions permitted, and that are also subject to seasonal, fixed and temporary load restrictions. Sign in to or create a Kingston Permit Central account to easily apply for Excess load annual permit online. ",
    "pdfs": []
  },
  {
    "heading": "Excess load single permit",
    "text": "An Oversize/Overweight Load - Trip Permit (OO Trip) is required for the transportation of a load(s) that exceeds the limits prescribed in the Highway Traffic Act (HTA), on a specific day(s), on a specific route, that is not already allowed for by a current Oversize/Overweight Load - Annual Permit (OO Annual). Sign in to or create a Kingston Permit Central account to easily apply for Excess load single permit online. ",
    "pdfs": []
  },
  {
    "heading": "Encroachment permit",
    "text": "You need a permit for any object or material, such as a building, sign, equipment, or fence, that is on a City roadway. Read the Encroachment Bylaw to learn more. Sign in to or create a MyKingston account to easily apply for Encroachment permit online. Terms and conditions General Conditions Traffic management Winter conditions Site Conditions Collection of solid waste Tree preservation conditions ",
    "pdfs": [
      {
        "text": "Encroachment Bylaw",
        "url": "https://www.cityofkingston.ca/media/bicdtdba/clerks_bylaw_encroachment.pdf"
      }
    ]
  },
  {
    "heading": "Road cut permit",
    "text": "If you require to cut into roads, sidewalks, and pathways that are part of the right-of-way, you will require a road cut permit. Sign in to or create a MyKingston account to easily apply for Road cut permit online. Cut permit requirements and guidelines All contractors are responsible for obtaining all applicable utility locates prior to the commencement of any work. All contractors will temporarily reinstate the road and sidewalk surface with Hot Mix Asphalt and leave the work area prepared for inspection. Should Hot Mix Asphalt not be available, Cold Mix Asphalt (QPR product) can be used to reinstate the applicable surfaces. All areas disturbed by the project shall be reinstated to equal or better condition to the satisfaction of the City of Kingston. The contractor and/or Permit holder must maintain and warranty a temporary repair made to a road, sidewalk, boulevard until such as the permanent repair is completed. The permanent restoration of a temporary repair shall be maintained and warranty for a period of 24 months from the date of completion and acceptance by the City. Permanent restorations shall be made in accordance with the City of Kingston’s current trench reinstatement and resurfacing standards & specifications. Any permanent repair and resurfacing of utility/road cuts that are close to the wheel path shall include the wheel path and/or any existing construction joints within the pavement area. Should any curb work, monolithic sidewalk and/or any other related longitudinal works disturbs an established bike lane and/or pathway system(s) the asphalt restoration shall be a full length and width grind and asphalt overlay of the applicable bike lane and/or pathway system(s). City’s assigned Engineering Technologist must be contracted prior to asphalt being placed. Hot mix asphalt type shall be as specified. The surface course to be placed in a 40mm lift. Asphalt shall be installed with attention paid to grade and ride. Inappropriate installation will be, rejected and reinstatement required. All granular material, whether used as backfill in the trench excavation or as road base, shall be compacted in maximum 150mm lifts to 100% Standard Proctor Density. Compaction tests to be arranged and completed by the contractor. The contractor shall exclude from back fill-frozen material, organic matter, rock larger than will pass through a 15cm ring, silt, mud or clay in fluid state. Where necessary, part or all of the excavated material shall be replaced by crushed stone. Contractors are responsible to reinstate any and all line painting and pavement markings in accordance with City standards and specifications. All grassed areas shall be reinstated with 100mm of topsoil and seed (or sod), in accordance with OPSS. MUNI 802 and 804. Sidewalk restoration shall be a minimum of one full bay, including expansion joints. All concrete shall be in accordance with OPSS.MUNI 351, with the thickness of the sidewalk being a minimum of 125mm. For commercial, industrial, and multi-residential driveways 150mmx150mm wire mesh shall be used. Concrete shall conform to the following: All works shall comply with all applicable Ontario Provincial Standards & Specifications and the City of Kingston’s Standards & Specifications and By-laws. Areas with Archaeological Potential In the event that deeply buried or previously undiscovered archaeological deposits are discovered in the course of land disturbance, all work must immediately cease and the site must be secured. The Archaeology Program Unit of the Ministry of Citizenship and Multiculturalism ( archaeology@ontario.ca ) must be immediately contacted. Please also keep the City of Kingston’s Heritage Services team (te tel:613-546-4291 , ext. 1398 / heritageplanning@cityofkingston.ca ) apprised of the evolving situation. In the event that human remains are encountered, all work must immediately cease and the site must be secured. The Kingston Police ( 613-549-4660 ), the Office of the Chief Coroner as a part of the Ontario Ministry of the Solicitor General ( 1-877-991-9959 ), and the Archaeology Program Unit of the Ministry of Citizenship and Multiculturalism ( archaeology@ontario.ca ) must be immediately contacted. Please also keep the City of Kingston’s Heritage Services team (613-546-4291, ext. 1398 / heritageplanning@cityofkingston.ca ) apprised of the evolving situation. When performing Work in an area of archaeological potential, it is recommended that an archaeological assessment and clearance be completed. Should this not be possible, it is highly recommended to use existing trenches or focus Works in areas where soils have already been disturbed. The Applicant shall exhaust all trenchless construction methods available to minimize the number and size of cuts and may also be required to perform more extensive site restoration than would normally be expected. Properties Designated or Listed under the Ontario Heritage Act When performing Work on or near a property Designated or Listed under the Ontario Heritage Act , please contact the Heritage Planning team at heritageplanning@cityofkingston.ca or 613-546-4291 ext. 1398 to confirm heritage approval requirements. The City of Kingston maintains a Heritage Register that identifies heritage resources, which can be found here: City of Kingston - Heritage Register Map If the Work will be on or near a property Designated or Listed under the Ontario Heritage Act , the Applicant shall take extra care not to disturb any landscaping or built features. The Applicant shall exhaust all means to minimize impacts to heritage resources and may also be required to perform more extensive site restoration than would normally be expect Dewatering of the Project Site Any dewatering to City lands or infrastructure, including storm storm sewers, will require a Dewatering Permit issued from the City's Engineering department prior to conducting work. Failure to obtain a Dewatering Permit will result in fines and/or charges in accordance with part 17 of the City of Kingston Sewer Use By-law NO. 2008-192. To obtain a Dewatering Permit, please contact Engineering Services at 613-546-4292 extension 3130 or engineering@cityofkingston.ca Site Check An Engineering Technologist from the City’s Transportation Services must be contacted 48 hours prior to the work being undertaken. Contact City’s Engineering Technologist –Corridor Control at transportation@cityofkingston.ca . Contact Us City of Kingston City Hall 216 Ontario Street Kingston, ON K7L 2Z3 Canada contactus@cityofkingston.ca Phone: 613-546-0000 The City of Kingston acknowledges that we are on the traditional homeland of the Anishinabek, Haudenosaunee, and the Huron-Wendat, and thanks these nations for their care and stewardship over this shared land. Today, the City is committed to working with Indigenous peoples and all residents to pursue a united path of reconciliation. Learn more about the City's reconciliation initiatives . ",
    "pdfs": []
  }
]