[
  {
    "heading": "Tree Bylaw and Permits",
    "text": "The Tree Bylaw in Kingston lays out when you need a tree permit before removing or injuring trees. It also outlines where there are removal restrictions on tree removal in designated woodlands and environmental protection areas. The bylaw does not restrict removals as part of normal farm practices and provides additional information on compensation and legal agreements. Residential property owners should ensure that the tree they want to remove is not within the municipal right-of-way or protected under a Tree Preservation and Protection Plan. What is a Tree Preservation and Protection Plan? A Tree Preservation and Protection Plan is a detailed document that ensures the protection of trees during construction projects. To obtain a tree preservation and protection plan, you must hire a qualified forestry consultant. A certified arborist, certified tree marker, or registered professional forester must prepare the report. Ensure they hold the required certifications and memberships. ",
    "pdfs": [
      {
        "text": "Tree Bylaw",
        "url": "https://www.cityofkingston.ca/media/02vlffzm/clerks_bylaw_tree.pdf"
      }
    ]
  },
  {
    "heading": "Tree permit application",
    "text": "Tree permits may require planting replacement trees. While removal may be necessary due to natural causes, our goal is to maintain, if not increase, the amount of tree coverage throughout the city. If you are applying for a tree permit, you must: Apply Now When is a tree permit required to remove a tree? A tree permit is required under these circumstances: The Tree Bylaw applies to new developments requiring planning approvals. If tree removal is needed before receiving planning approvals, a separate tree permit is necessary. For commercial harvesting on properties larger than one hectare, a tree permit is required, unless a forest management plan prepared by a registered professional forester is accepted by the Director of Planning Services. What is an arborist report? To obtain an arborist report, you must hire a qualified forestry consultant. The report should be prepared by a certified arborist, a certified tree marker, or a registered professional forester. These individuals must have the necessary certifications and memberships. The report must adhere to the Guidelines for the Completion of an Arborist's Report . Can I appeal a decision regarding a tree permit? You can appeal to City Council under these two situations: ",
    "pdfs": [
      {
        "text": "Guidelines for the Completion of an Arborist's Report",
        "url": "https://www.cityofkingston.ca/media/jsrcbkhp/publicworks_guide_arboristreport.pdf"
      }
    ]
  },
  {
    "heading": "Permit exceptions",
    "text": "In certain situations, obtaining a tree permit is not necessary. However, if you have recently (within the past two years) completed a pre-application process for a Planning Act application, or if you currently have a Planning Act application pending with the City, the exceptions below may not apply. Pruning and other tree maintenance You can prune a tree without a tree permit as long as it does not harm the tree. To learn proper pruning techniques, contact a Certified Arborist certified by the International Society of Arboriculture. For tree removal, a tree permit is not needed if the tree is dead, severely damaged, diseased, or poses a danger. However, you must provide proof from a Certified Arborist to the Director of Planning Services for approval. You can find more information on pruning and tree services on the International Society of Arboriculture’s website Trees Are Good . Urban residential properties In the city’s urban area, if a residential property was built before the Tree Bylaw or if it was created through a subdivision, consent, part lot control, or a condominium plan, you don’t need a tree permit as long as the trees are not in an Environmental Protection Area or Significant Woodland. But if you want to remove trees in these protected areas, you need a permit and approval from an Environmental Impact Assessment. Just make sure the tree is on your private property. If the tree is within a road right-of-way, it is considered a municipal tree and we are responsible for its maintenance and removal. Removing a municipal tree without permission is against the Tree Bylaw. If a tree crosses property lines or its branches overhang onto neighbouring properties, it is a civil issue between neighbours, and cannot be settled through the Tree Bylaw. New development You don't need a tree permit if you have a building permit and the trees you want to remove are within 15 meters of the building or structure you're constructing. You also do not need a tree permit for installing a driveway or public or private utilities if there is no reasonable place to avoid removing the tree. Other exemptions Other activities may also be exempt from requiring a tree permit, such as: However, it is best to confirm with our staff before removing any trees. You can contact the Planning Services at 613-546-4291 , ext. 3180 to determine if a permit is required. ",
    "pdfs": []
  },
  {
    "heading": "Tree bylaw violation penalties",
    "text": "If you break the Tree Bylaw, the conditions of a tree permit, or an order, you may face the following penalties: Contact Us City of Kingston City Hall 216 Ontario Street Kingston, ON K7L 2Z3 Canada contactus@cityofkingston.ca Phone: 613-546-0000 Contact Bylaw Enforcement bylawenforcement @cityofkingston.ca Phone: 613-546-0000 Contact Building and Planning Services 1211 John Counter Blvd. Kingston, ON K7L 4X7 buildingpermits@cityofkingston.ca planning@cityofkingston.ca Phone: 613-546-4291 ext. 3180 The City of Kingston acknowledges that we are on the traditional homeland of the Anishinabek, Haudenosaunee, and the Huron-Wendat, and thanks these nations for their care and stewardship over this shared land. Today, the City is committed to working with Indigenous peoples and all residents to pursue a united path of reconciliation. Learn more about the City's reconciliation initiatives . ",
    "pdfs": []
  }
]