[
  {
    "heading": "Building Permits",
    "text": "Review the 2024 Ontario Building Code updates that came into effect on Jan. 1, 2025, and ensure compliance before submitting your building permit. You need a building permit for all construction activities, including residential, industrial, and commercial projects.  A building permit allows us to make sure that construction around Kingston is done safely and according to code. Apply online through DASH or in person at 1211 John Counter Boulevard. Views the Building Bylaw or the Sign Bylaw to learn more. DASH benefits For information on permit costs, refer to the rates and fees in the new Building Services Fees summary . 2024 Ontario Building Code Updates Review the 2024 OBC updates that come into effect on Jan. 1, 2025. Additional Residential Units (ARUs) Learn about development requirements for ARUs and apply for a permit. Deck Permits Learn about deck construction requirements and apply for a permit. Fire Alarm Systems Get more information about fire alarm system requirements and when to get a permit. Heritage Permits Request a heritage permit, look for approval, or nominate a property for heritage protection. Larger Construction Permits Learn about the requirements for industrial, commercial, institutional, and multi-unit residential projects. Plumbing and Sewage System Permits Learn about septic requirements and apply for a permit. Pool Permits Learn about development requirements for pools and apply for a permit. Right-of-Way Permits Learn about city-owned right-of-way property, and how to apply for a permit. ",
    "pdfs": [
      {
        "text": "new Building Services Fees summary",
        "url": "https://www.cityofkingston.ca/media/kwmpr0xh/building-permit-fee-summary-may-21-2025.pdf"
      }
    ]
  },
  {
    "heading": "Inspections",
    "text": "You can now request and schedule an inspection through DASH . Inspections require 24 hours' notice and can only be scheduled up to two weeks in advance. You can also request inspections by calling 613-546-4291 ext. 3280; between 8 a.m. and 4:30 p.m. with 48 hours' notice. The cost for inspections is included in the building permit fee. ",
    "pdfs": []
  },
  {
    "heading": "Inspections by outside agencies",
    "text": "Electrical installations require inspections. To arrange an inspection for any electrical installation, contact the Electrical Safety Authority at 1-877-372-7233 . Installations of gas equipment and appliances require inspections. To arrange an inspection for any gas appliance or equipment installation, call at 1-800-263-3688 . ",
    "pdfs": []
  },
  {
    "heading": "When to get a building permit",
    "text": "Expand the headings below for a detailed list of when you need a building permit and when you don't. When is a building permit required? You need a building permit for any work in heritage district or on a heritage building, as well as for the following: When is a building permit not required? ",
    "pdfs": []
  },
  {
    "heading": "Building permit reports and map",
    "text": "We share building permit reports on Open Data Kingston . This platform lets you customize data viewing, including filtering, searching and mapping options to suit your preferences. Open Data Kingston collects and shares information in accordance with the Municipal Freedom of Information and Protection of Privacy Act . View Data ",
    "pdfs": []
  },
  {
    "heading": "Code of Conduct for Building Officials",
    "text": "The following Code of Conduct for Building Officials was approved by council at their meeting on December 13, 2005. Purpose The Code of Conduct for Building Officials is enacted in accordance with Section 7.1 of the Building Code Act 1992 (the \"Act\") which requires a Code of Conduct for the following purposes: Application This Code of Conduct applies to the Chief Building Official for the City of Kingston and each Building Official and is in addition to the provisions of the Collective Agreement and Human Resources Corporate Policy on Employee Code of Conduct. Expected standards of behaviour and performance of duty The CBO and Inspectors are expected to: Allegations of breaches of the code Contradictions of this Code of Conduct are a serious matter to the Corporation and will be dealt with as such. The CBO will review all allegations made against Inspectors. Allegations made against the CBO will be reviewed by the City of Kingston Corporate Management Team. Upon review of the allegations, either the CBO in the case of complaints against Inspectors, or the Corporate Management Team in the case of complaints against the CBO, may determine an appropriate course of action to resolve the complaint. Corrective action and/or disciplinary action If a complaint is substantiated, the CBO in the case of complaints against Inspectors, or the Corporate Management Team in the case of complaints against the CBO, will determine the corrective action and/or disciplinary action arising from the contravention of the Code. Corrective action and/or disciplinary action may include, but is not limited to, the following: Contact Building Services 1211 John Counter Boulevard Kingston, ON K7K 6C7 buildingpermits @cityofkingston.ca Phone: 613-546-4291 ext. 3280 The City of Kingston acknowledges that we are on the traditional homeland of the Anishinabek, Haudenosaunee, and the Huron-Wendat, and thanks these nations for their care and stewardship over this shared land. Today, the City is committed to working with Indigenous peoples and all residents to pursue a united path of reconciliation. Learn more about the City's reconciliation initiatives . ",
    "pdfs": []
  },
  {
    "heading": "2024 Ontario Building Code Updates",
    "text": "The 2024 Ontario Building Code (OBC) came into effect on Jan. 1, 2025, with a three-month grace period until March 31, 2025, for certain designs that were already substantially complete. All building permit applications submitted after March 31 will only be reviewed under the 2024 Ontario Building Code. These significant updates impact building design, construction, and safety standards. This overview highlights the key changes to help you understand the requirements and ensure compliance when planning your next building project and applying for building permits. For details on the new 2024 Ontario Building Code, including timing and transition provisions, please visit the Ontario website . ",
    "pdfs": []
  },
  {
    "heading": "Topics covered:",
    "text": "New Definitions Farm Buildings (Part 2) Large buildings (Part 3) Structural (Part 4) Environmental and HVAC (Parts 5,6) Plumbing and Septic Systems (Parts 7,8) Houses and Small Buildings (Part 9) Change of use and Division C (Parts 10,11) Two Unit Houses Fire Protection Accessibility Radon Mitigation  ",
    "pdfs": []
  },
  {
    "heading": "New definitions",
    "text": "",
    "pdfs": []
  },
  {
    "heading": "Farm buildings (Part 2)",
    "text": "Farm buildings with low human occupancy (one person per 40 m² or less during normal use) must follow the 2024 OBC if they are: Small farm buildings remain under the National Farm Building Code if they: ",
    "pdfs": []
  },
  {
    "heading": "New definitions",
    "text": "",
    "pdfs": []
  },
  {
    "heading": "Large buildings (Part 3)",
    "text": "",
    "pdfs": []
  },
  {
    "heading": "Midrise wood frame construction (over 4 storeys)",
    "text": "",
    "pdfs": []
  },
  {
    "heading": "Mezzanines and interconnected floor space",
    "text": "",
    "pdfs": []
  },
  {
    "heading": "Wood frame construction",
    "text": "",
    "pdfs": []
  },
  {
    "heading": "Safety within floor areas",
    "text": "",
    "pdfs": []
  },
  {
    "heading": "Building facing a street",
    "text": "",
    "pdfs": []
  },
  {
    "heading": "Roof assembly fire resistance rating",
    "text": "",
    "pdfs": []
  },
  {
    "heading": "New provisions for 18-storey encapsulated mass timber buildings",
    "text": "",
    "pdfs": []
  },
  {
    "heading": "Structural (Part 4)",
    "text": "Environmental and HVAC (Parts 5,6) *Heating, Ventilation, and Air Conditioner (HVAC) The new BCO introduces terms like “non-heating season ventilation” and “heating season ventilation.” It also covers natural and mechanical ventilation systems for non-heating seasons. ",
    "pdfs": []
  },
  {
    "heading": "Airtightness",
    "text": "Updated requirements include air barrier installation details and airtightness standards. Below-grade airtightness now addresses radon and soil gases. ",
    "pdfs": []
  },
  {
    "heading": "New setback",
    "text": "Outdoor air intakes must be installed at least 0.3 m above roofs, landscape grades, or other surfaces, considering snow accumulation (6.3.2.9). Vented combustion products require new setbacks (6.3.2.15). ",
    "pdfs": []
  },
  {
    "heading": "Evaporative heat rejection systems",
    "text": "Added to reduce the spread of disease-causing microorganisms. ",
    "pdfs": []
  },
  {
    "heading": "Air handling systems",
    "text": "These systems must now include smoke detectors. ",
    "pdfs": []
  },
  {
    "heading": "Carbon monoxide alarms",
    "text": "A carbon monoxide alarm is defined as a device with an audible alarm that activates when airborne carbon monoxide exceeds a set level for a specific duration. Must be installed in residential or care suites with: Service rooms, each sleeping room, and public corridors serving residential suites require an alarm. In corridors, alarms must be installed so there is at least one in each section and no more than 25 m apart. ",
    "pdfs": []
  },
  {
    "heading": "Exposed pipe temperature",
    "text": "Maximum allowed temperature reduced from 70°C to 52°C. ",
    "pdfs": []
  },
  {
    "heading": "Ventilation systems",
    "text": "Updated to reduce health risks and include changes to outdoor air intake placement, building drainage system connections, maintenance access, and crawlspaces that are unconditioned and unoccupied. ",
    "pdfs": []
  },
  {
    "heading": "Plumbing and septic systems (Parts 7,8)",
    "text": "",
    "pdfs": []
  },
  {
    "heading": "Seismic forces",
    "text": "Plumbing systems in Part 3 buildings must now be designed to handle seismic forces. ",
    "pdfs": []
  },
  {
    "heading": "Pipe sizing",
    "text": "The sizing of pipes has changed to Nominal Pipe Size (NPS) , which refers to the commercially designated diameter of pipes, fittings, traps, and similar items. ",
    "pdfs": []
  },
  {
    "heading": "Shut-off valves",
    "text": "",
    "pdfs": []
  },
  {
    "heading": "Maximum flush cycle",
    "text": "New restrictions on the amount of water used in flush cycles for water closets and urinals. A table for maximum water flow rates has been added. ",
    "pdfs": []
  },
  {
    "heading": "Rainwater harvesting",
    "text": "New provisions for non-potable rainwater harvesting systems: ",
    "pdfs": []
  },
  {
    "heading": "Catch basins",
    "text": "New requirements for maintenance holes and catch basins. Increased developed length between building and first manhole from 30m to 75m. ",
    "pdfs": []
  },
  {
    "heading": "Traps",
    "text": "",
    "pdfs": []
  },
  {
    "heading": "Sumps and tanks",
    "text": "Provisions for sumps or tanks receiving subsurface water must now have a water- and air-tight cover. ",
    "pdfs": []
  },
  {
    "heading": "Make-up water connections",
    "text": "These connections must be equipped with backflow prevention devices. ",
    "pdfs": []
  },
  {
    "heading": "Hot water temperature control",
    "text": "Temperature control in hot water systems for care and childcare facilities reduced from 49 to 43 degrees Celsius. ",
    "pdfs": []
  },
  {
    "heading": "Septic systems",
    "text": "",
    "pdfs": []
  },
  {
    "heading": "Houses and small buildings (Part 9)",
    "text": "",
    "pdfs": []
  },
  {
    "heading": "Stairs",
    "text": "Changes to stair design include: ",
    "pdfs": []
  },
  {
    "heading": "Windows",
    "text": "Windows on the second storey or higher in dwelling units must now: ",
    "pdfs": []
  },
  {
    "heading": "Fire safety",
    "text": "New provisions for fire separations and smoke-tight barriers, including: ",
    "pdfs": []
  },
  {
    "heading": "ICF foundation systems",
    "text": "Insulated Concrete Form (ICF) foundation walls now apply to buildings up to two storeys high with a maximum floor-to-floor height of 3m. ",
    "pdfs": []
  },
  {
    "heading": "Wood frame construction",
    "text": "Updates include: ",
    "pdfs": []
  },
  {
    "heading": "Insulation and vapour barrier",
    "text": "New requirements include: ",
    "pdfs": []
  },
  {
    "heading": "Cladding",
    "text": "New rules for attaching siding to ICF forms and sheathing. Insulated vinyl and polypropylene siding are now permitted. ",
    "pdfs": []
  },
  {
    "heading": "Snow loads",
    "text": "Snow load calculations are now required for roof steps over 2m where the upper roof is 1 in 6 or less and exceeds 600m². ",
    "pdfs": []
  },
  {
    "heading": "Ventilation and vents",
    "text": "",
    "pdfs": []
  },
  {
    "heading": "Carports",
    "text": "Revised to allow only one unit for carports and removed the provision for houses with two units. ",
    "pdfs": []
  },
  {
    "heading": "Basement temperature",
    "text": "The indoor design temperature for unfinished basements has been lowered from 22°C to 18°C. ",
    "pdfs": []
  },
  {
    "heading": "Change of use and Division C (Parts 10,11)",
    "text": "",
    "pdfs": []
  },
  {
    "heading": "Farm buildings",
    "text": "Part 10 and 11 have been updated to include a Group G classification for farm buildings and houses with secondary suites. ",
    "pdfs": []
  },
  {
    "heading": "Heating, Ventilation, and Air Conditioner (HVAC)",
    "text": "",
    "pdfs": []
  },
  {
    "heading": "Underpinning",
    "text": "A new requirement states that underpinning must be designed by a Professional Engineer. \"Underpinning\" is now defined as the process of strengthening or lowering the foundation of an existing building. ",
    "pdfs": []
  },
  {
    "heading": "General review",
    "text": "New requirements have been added for the general review of agricultural buildings. ",
    "pdfs": []
  },
  {
    "heading": "Occupancy requirements",
    "text": "An occupancy permit cannot be issued unless the building complies with section 168.3.1 of the Environmental Protection Act. ",
    "pdfs": []
  },
  {
    "heading": "Two unit houses",
    "text": "",
    "pdfs": []
  },
  {
    "heading": "Definitions revised",
    "text": "The term \"house\" has been removed from Division A 1.4.1.2, and a new definition for \"Secondary Suite\" has been added. A secondary suite is a self-contained dwelling unit located in a building with only one other dwelling unit, sharing common spaces, and both units together form a single real estate entity. ",
    "pdfs": []
  },
  {
    "heading": "Lower ceiling heights",
    "text": "Ceiling height requirements for secondary suites are slightly lower than other residential spaces: ",
    "pdfs": []
  },
  {
    "heading": "Egress",
    "text": "A new exception for egress has been added for houses with secondary suites, unless the second floor opens onto an exterior passageway. ",
    "pdfs": []
  },
  {
    "heading": "Smoke alarms",
    "text": "Smoke alarms in secondary suites can now also be interconnected wirelessly throughout the entire building (previously hard wired - 9.10.9.5). ",
    "pdfs": []
  },
  {
    "heading": "Fire safety barriers",
    "text": "A continuous, smoke-tight barrier made of 5/8” type X drywall is required on the underside of floors and on both sides of walls between units. ",
    "pdfs": []
  },
  {
    "heading": "Heating systems",
    "text": "If the heating system is shared between units, the return air cannot be interconnected between them. ",
    "pdfs": []
  },
  {
    "heading": "Thermostats",
    "text": "Each dwelling unit must have its own thermostat for independent control. ",
    "pdfs": []
  },
  {
    "heading": "Fire protection",
    "text": "",
    "pdfs": []
  },
  {
    "heading": "Combustible dust",
    "text": "This applies to standpipe requirements for grain handling and storage facilities and the design of hazardous areas. Combustible dust refers to particles that are flammable and can cause explosions. ",
    "pdfs": []
  },
  {
    "heading": "Sprinkler system",
    "text": "",
    "pdfs": []
  },
  {
    "heading": "Fire alarm and detection system",
    "text": "A fire alarm system is required in buildings with sprinklers, except those with fewer than 9 sprinklers. Key requirements include: ",
    "pdfs": []
  },
  {
    "heading": "Standpipe",
    "text": "",
    "pdfs": []
  },
  {
    "heading": "Hose stations",
    "text": "Hose stations must be within 5 meters of exits in unsprinklered areas. Special provisions include: ",
    "pdfs": []
  },
  {
    "heading": "Lighting and power",
    "text": "A minimum level of lighting is required along escalators, moving walks, controls, signs with visual information, doors with electromagnetic locks, and in universal washrooms and showers. ",
    "pdfs": []
  },
  {
    "heading": "Emergency power",
    "text": "Buildings must now have two hours of emergency power for water-supplied fire suppression systems that rely solely on electricity. ",
    "pdfs": []
  },
  {
    "heading": "Clarification for firefighting",
    "text": "Specific guidelines have been clarified for buildings that don’t face a street and for buildings without dwelling units above another (Part 9 only). ",
    "pdfs": []
  },
  {
    "heading": "Accessibility",
    "text": "",
    "pdfs": []
  },
  {
    "heading": "Pedestrian entrances",
    "text": "All entrances to barrier-free storeys must be barrier-free and connected to a barrier-free path of travel (3.8.1.2). ",
    "pdfs": []
  },
  {
    "heading": "Floor areas",
    "text": "In two-storey buildings, floor areas above or below the entrance storey do not require a barrier-free path unless the building has an elevator, large assembly areas, or a floor area exceeding 600m². ",
    "pdfs": []
  },
  {
    "heading": "Access to parking",
    "text": "Changes now require barrier-free paths of travel to building entrances, exterior passenger loading zones, and parking areas, including storage garages. ",
    "pdfs": []
  },
  {
    "heading": "Signage",
    "text": "Signs must indicate the location of barrier-free entrances, ramps, washrooms, elevators, parking spaces, and assistive listening systems. Tactile (Braille) signage is required. ",
    "pdfs": []
  },
  {
    "heading": "Water bottle filling stations",
    "text": "At least one water bottle filling station must be barrier-free, with automatic controls, accessible height, and proper clearance for operation. ",
    "pdfs": []
  },
  {
    "heading": "Power door operators",
    "text": "Doors with self-closing devices must also be equipped with power door operators (3.8.3.3). ",
    "pdfs": []
  },
  {
    "heading": "Service counters",
    "text": "At least one service counter in public areas must be equipped with an assistive listening system or adaptive technology, and an amplification system if there's a barrier to communication, such as a glass screen (3.8.3.7). ",
    "pdfs": []
  },
  {
    "heading": "Shower and dressing rooms",
    "text": "At least one universal dressing and shower room must be provided in areas with public or customer use, or in common-use employee areas (3.8.3.13). ",
    "pdfs": []
  },
  {
    "heading": "Elevator requirements",
    "text": "The elevator's clear floor area must be 1.5m x 1.0m, with defined entry doors and gate sizes. ",
    "pdfs": []
  },
  {
    "heading": "Radon mitigation",
    "text": "The following updates change the current three compliance options, now including a full system or a rough-in with the new requirements: Contact Us City of Kingston City Hall 216 Ontario Street Kingston, ON K7L 2Z3 Canada contactus@cityofkingston.ca Phone: 613-546-0000 The City of Kingston acknowledges that we are on the traditional homeland of the Anishinabek, Haudenosaunee, and the Huron-Wendat, and thanks these nations for their care and stewardship over this shared land. Today, the City is committed to working with Indigenous peoples and all residents to pursue a united path of reconciliation. Learn more about the City's reconciliation initiatives . ",
    "pdfs": []
  },
  {
    "heading": "Additional Residential Units (ARUs)",
    "text": "Get faster design and permit approvals with code-compliant plans created with builders. Explore Pre-Reviewed Detached ARU Plans ! An Additional Residential Unit (ARU) is an independent dwelling unit located within the same building or on the same property as a single-detached or semi-detached house or townhouse dwelling.  ARUs may also be known as secondary suites, in-law suites, carriage houses or tiny homes. We are encouraging the development of ARUs to increase the supply of rental housing, help property owners cover mortgage costs with rental income, offer alternative housing options, and utilize existing public infrastructure efficiently. ARU Permits Learn about development requirements and apply for a permit. ARU Incentive Programs Explore our ARU grant incentive program with forgivable loans, funding options, and support for service upgrades. Pre-Reviewed Detached ARU's Explore our pre-approved plans for detached ARUs to simplify your permit process. ",
    "pdfs": []
  },
  {
    "heading": "Types of ARUs",
    "text": "There are four types of additional residential units you can build and apply for a permit: ",
    "pdfs": []
  },
  {
    "heading": "Plan your project",
    "text": "Make sure your property complies with the requirements of the zoning bylaw by reviewing our Zoning Bylaw map . You can add additional residential units to most properties in Kingston, with the exception of rural properties. Restricted areas Additional residential units are not permitted: To construct or legalize an additional residential unit on a property that is located within the areas noted above you may need an individual analysis. You may require a site-specific zoning bylaw amendment. Note: To establish an additional residential unit in areas identified as ‘Water Supply/Water Quantity’ and ‘Servicing Capacity (Cana Subdivision)’, you must apply for the removal of a holding symbol. Size limitations The gross floor area of a second residential unit can be equal to or less than that of the principal dwelling. According to the zoning bylaw, gross floor area includes the total area of each floor, whether above or below grade, as well as finished attic space. This measurement is taken between the outside of the exterior walls or between the exterior walls and the center line of party walls dividing the building from another. However, it excludes: open porches, balconies and attached garages for vehicle storage. Provide parking An additional residential unit requires at least one parking space that can be provided in a tandem (one vehicle behind the other) arrangement.​​​​​​​ Provide separate access You must provide safe entrance and exit in accordance with the requirements of the Building Code. Legalize an existing additional residential unit Owners are required to legalize additional units to ensure the unit meets the appropriate Building Code requirements. Be aware that renovations may be required to bring the dwelling up to zoning and Building Code compliance. An inspection conducted by a Building Inspector will determine any existing deficiencies and any required renovations to meet the requirements. New municipal address We will assign a new unit number to assist emergency services, home delivery, and mail services according to the building permitting and zoning review process, to recognize your additional residential unit Responsibilities as a landlord Owners of additional residential units must adhere to the responsibilities outlined within the Residential Tenancies Act. Additionally, all property owners must adhere to maintenance requirements beyond the Building Code and zoning provisions, in compliance with the City's Property Standards Bylaw, which sets out standards for the reasonable upkeep and maintenance of buildings and properties, including responsibilities such as yard maintenance and snow removal. ",
    "pdfs": []
  },
  {
    "heading": "Sustainable building",
    "text": "Help us actively pursue sustainability with your additional residential unit project. Here are some tips to enhance the energy efficiency of both your home and additional residential units: Contact Building Services 1211 John Counter Boulevard Kingston, ON K7K 6C7 buildingpermits @cityofkingston.ca Phone: 613-546-4291 ext. 3280 Contact Affordable Housing Department 362 Montreal St. Kingston, ON K7K 3H5 housing@cityofkingston.ca Phone: 613-546-2695 ext. 4836 The City of Kingston acknowledges that we are on the traditional homeland of the Anishinabek, Haudenosaunee, and the Huron-Wendat, and thanks these nations for their care and stewardship over this shared land. Today, the City is committed to working with Indigenous peoples and all residents to pursue a united path of reconciliation. Learn more about the City's reconciliation initiatives . ",
    "pdfs": []
  },
  {
    "heading": "ARU Permits",
    "text": "Review the 2024 Ontario Building Code Two Unit Houses updates that come into effect on Jan. 1, 2025, and ensure compliance before submitting your building permit. All new and existing additional residential units must comply with the Ontario Building Code and require a permit. The rules for permits are different for a new build construction unit versus renovating an existing building to create additional units. Building Officials will inspect to make sure the additional residential unit(s) in your house or on your property meet safety standards and the Ontario Building Code. Apply online through DASH (Development and Services Hub), our online portal that gives you 24 / 7 access to planning, development, and building services and active development activity. Apply Now ",
    "pdfs": []
  },
  {
    "heading": "Additional residential unit permit guide",
    "text": "Check out our Additional Residential Unit Permit Guide for more information on Ontario Building Code requirements, getting a building permit, and building inspections. Contact Building Services 1211 John Counter Boulevard Kingston, ON K7K 6C7 buildingpermits @cityofkingston.ca Phone: 613-546-4291 ext. 3280 Contact Affordable Housing Department 362 Montreal St. Kingston, ON K7K 3H5 housing@cityofkingston.ca Phone: 613-546-2695 ext. 4836 The City of Kingston acknowledges that we are on the traditional homeland of the Anishinabek, Haudenosaunee, and the Huron-Wendat, and thanks these nations for their care and stewardship over this shared land. Today, the City is committed to working with Indigenous peoples and all residents to pursue a united path of reconciliation. Learn more about the City's reconciliation initiatives . ",
    "pdfs": [
      {
        "text": "Additional Residential Unit Permit Guide",
        "url": "https://www.cityofkingston.ca/media/adyfer21/planning_guide_secondresidentialunitpermits.pdf"
      }
    ]
  },
  {
    "heading": "Additional Residential Unit Incentive Program",
    "text": "The Additional Residential Unit (ARU) Incentive has five incentives and grants that help property owners create alternative housing options within the city. Property owners that create an ARU and agree to meet the conditions of the program can get funding. The funding options include forgivable loan incentives and non-repayable grants. If you receive a forgivable loan, you do not need to repay this loan if you continue to meet the program terms for five years. We review and approve applications on a first-come, first-served basis while funding is available. ",
    "pdfs": []
  },
  {
    "heading": "1. Detached ARU Incentive",
    "text": "The detached ARU incentive provides eligible property owners financial help of up to 50% of the project cost or $40,000, whichever is less. ",
    "pdfs": []
  },
  {
    "heading": "2. Interior ARU Incentive",
    "text": "The Interior ARU incentive provides eligible property owners financial help of up to 50% of the project cost or $30,000, whichever is less. ",
    "pdfs": []
  },
  {
    "heading": "3. Accessibility ARU Grant",
    "text": "The accessibility ARU Grant provides a $5,000 extra funding to an ARU project that meets accessibility criteria. We encourage the development of more accessible housing options. ",
    "pdfs": []
  },
  {
    "heading": "4. Rough-In Detached ARU Grant",
    "text": "The rough-in detached ARU grant provides $5,000 of extra funding to property owners that install rough-in servicing (i.e. water supply, sanitary sewer, and electrical supply) to accommodate a future detached ARU project. ",
    "pdfs": []
  },
  {
    "heading": "5. ARU Servicing Constraint Area Grant",
    "text": "The ARU Servicing Constraint Area grant provides eligible property owners financial help of up to 50% of the construction cost or $1 0,000, whichever is less to upgrade an ex isting half inch water s ervice . ",
    "pdfs": []
  },
  {
    "heading": "How to apply",
    "text": "Please note that property owners must apply and obtain an ARU building permit to be eligible for the ARU incentive program. Sign up/log in to MyKingston to complete your application online and ensure we can fulfill your request effectively. If you have questions, please call 613-546-2695 ext. 4836 or email housing@cityofkingston.ca . Apply now ",
    "pdfs": []
  },
  {
    "heading": "Program eligibility criteria",
    "text": "Terms of the ARU Incentive Program Rough-In Detached ARU grant and ARU Servicing Constraint Area grant To receive the Rough-In Detached ARU Grant or the ARU Servicing Constraint Area Grant, you must complete all work according to the regular building permit and inspection process. This includes installing the sewer lateral and submitting a verification form. Accessibility Grant ARUs are not subject to mandatory accessibility requirements under the Ontario Building Code; however, including accessibility features is optional and can qualify your project for additional funding. The program offers a $5,000 top-up for units that voluntarily meet these criteria. To qualify for the accessibility top-up, your unit must include: ",
    "pdfs": []
  },
  {
    "heading": "Tenant household eligibility criteria",
    "text": "Affordable rents table The following table outlines the affordable rent (inclusive of utilities) for a unit occupied in 2025. Unit Size Average Market Rent 90% Average Market Rent (Affordable Rent) Bachelor Unit $1,064 $958 One Bedroom Two Bedroom $1,676 $1,508 Three Bedroom $2,004 $1,804 Maximum income levels table The following table outlines the maximum gross income levels per household type. Unit Size Maximum Gross Income Levels Bachelor Unit $38,500 One Bedroom $50,500 Two Bedroom $60,500 Three Bedroom $65,000 ",
    "pdfs": []
  },
  {
    "heading": "After a project gets approved",
    "text": "You will receive a Conditional Letter of Commitment. You will have one year to complete the work and occupy the ARU in compliance with the Loan Agreement. ",
    "pdfs": []
  },
  {
    "heading": "How to receive funding after you complete the project",
    "text": "After finding an eligible tenant , the property owner must complete the following steps to receive funding: Frequently asked questions Does the loan have any interest and do I need to make any payments? Provided the property owner rents the ARU following the terms of the agreement, they do not need to make any payments during the five-year period of the agreement. What costs are eligible? Eligible costs are those related to the creation of the ARU. Some common costs covered: Keep in mind that this is not an exhaustive list. There may be other eligible costs depending on the type of project. I just completed an ARU project, am I eligible? Property owners must apply and obtain conditional approval before completing a project. What happens to the rent after the five-year period? At the end of the five-year period, the property owner can request the discharge of the security for the funding agreement at their own expense. Who can I rent the ARU to during the five-year period of the agreement? Eligible tenant s must have household incomes below the maximum income levels. See the Tenant Household Eligibility Criteria section for more information. What happens if I no longer meet the funding agreement requirements before the end of the five-year period? We only forgive loans for ARU projects that have continued to meet the terms of the agreement for a five-year term. Forgiveness would occur at a rate of 20% per year of compliance with the terms of the program. If during the five-year term, the ARU is no longer rented following the terms of the agreement, the property owner must pay the forgivable loan at a prorated rate. How much funding is available within the program? The program has an initial funding commitment of $1.25 million. I just applied to the program. When can I expect to hear back and how long is the process? We review completed applications and respond to each within two weeks. If the project is eligible, we will send a conditional letter of commitment indicating the applicant has one year to complete and occupy the unit following the terms of the program. Contact Building Services 1211 John Counter Boulevard Kingston, ON K7K 6C7 buildingpermits @cityofkingston.ca Phone: 613-546-4291 ext. 3280 Contact Affordable Housing Department 362 Montreal St. Kingston, ON K7K 3H5 housing@cityofkingston.ca Phone: 613-546-2695 ext. 4836 The City of Kingston acknowledges that we are on the traditional homeland of the Anishinabek, Haudenosaunee, and the Huron-Wendat, and thanks these nations for their care and stewardship over this shared land. Today, the City is committed to working with Indigenous peoples and all residents to pursue a united path of reconciliation. Learn more about the City's reconciliation initiatives . ",
    "pdfs": []
  },
  {
    "heading": "Pre-Reviewed Detached ARU's",
    "text": "To make it easier for property owners to add a detached ARU, we teamed up with builders to create a list of pre-reviewed building plans that meet Ontario Building Code standards. You must still submit your ARU Building Permit application, but using pre-reviewed plans will make the review process faster. All plans have been checked by City building staff, saving time during design and permit review. Having plans pre-reviewed for Building Code compliance does not mean they meet the Zoning Bylaw . Each property will need to be checked through the final permit process to ensure zoning compliance, as each lot configuration and ARU placement differs within lot constraints. Contact vendors directly to discuss your project. What are Detached Additional Residential Units? Detached Additional Residential Units (ARUs) are small houses, self-contained, dwelling units separated from the main dwelling and located in the rear or side yard for an existing single-detached or semi-detached dwelling or townhouse dwelling. They must contain: ",
    "pdfs": []
  },
  {
    "heading": "Brauer Housing Developments Inc.",
    "text": "Address: 107 S John Street, Belleville ON, K8N 3E5 Phone: 613-921-0042 Website: www.brauerhomes.ca Brauer Living Pods -  Studio Suite Learn more about the Brauer Living Pods specifications . Brauer Living Pods - Studio suite - Top view Contact the vendor for floorplans and elevations specifications of Brauer Living Pods - Studio suite. Brauer Living Pods - Studio suite - Front view Contact the vendor for floorplans and elevations specifications of Brauer Living Pods - Studio suite. Brauer Living Pods - One bedroom suite - Top view Contact the vendor for floorplans and elevations specifications of Brauer Living Pods - One bedroom suite. Brauer Living Pods - One bedroom suite - Front view Contact the vendor for floorplans and elevations specifications of Brauer Living Pods - One bedroom suite. Brauer Living Pods - Two bedroom suite - Top view Contact the vendor for floorplans and elevations specifications of Brauer Living Pods - Two bedroom suite. Brauer Living Pods - Two Bedroom Suite - Front view Contact the vendor for floorplans and elevations specifications of Brauer Living Pods - Two bedroom suite. ",
    "pdfs": [
      {
        "text": "Brauer Living Pods specifications",
        "url": "https://www.cityofkingston.ca/media/3y2jdjol/building_detached-aru-product-specification_brauer.pdf"
      }
    ]
  },
  {
    "heading": "First Capital Construction",
    "text": "Address: 1472 McAdoos Lane, Kingston ON, K0H 1S0 Phone: 613-530-2468 Website: www.firstcapitalconstruction.ca Studio A Learn more about the Studio model product specifications . Studio A Contact the vendor for floorplans and elevations specifications of the Studio model. Studio A Contact the vendor for floorplans and elevations specifications of the Studio model. ",
    "pdfs": [
      {
        "text": "Studio model product specifications",
        "url": "https://www.cityofkingston.ca/media/bzmjp0ke/building_product-specification_first-capital.pdf"
      }
    ]
  },
  {
    "heading": "Redden's Contracting Inc.",
    "text": "Address: 2485 McIvor Rd, Kingston ON, K7L 4V4 Phone: 613-453-9610 Website: www.reddenscontracting.ca Learn more about the product specifications . Learn more about the product specifications . Contact the vendor for floorplans and elevations specifications of the model. Contact the vendor for floorplans and elevations specifications of the model. Contact the vendor for floorplans and elevations specifications of the model. Please note: The City of Kingston makes no guarantees, representations, or warranty regarding the pre-reviewed detached ARU plans displayed here. The pre-reviewed detached ARU plans are intended to help property owners consider available options and connect property owners to vendors. All agreements and financial transactions will occur between the property owner and the vendor. Contact Building Services 1211 John Counter Boulevard Kingston, ON K7K 6C7 buildingpermits @cityofkingston.ca Phone: 613-546-4291 ext. 3280 Contact Affordable Housing Department 362 Montreal St. Kingston, ON K7K 3H5 housing@cityofkingston.ca Phone: 613-546-2695 ext. 4836 The City of Kingston acknowledges that we are on the traditional homeland of the Anishinabek, Haudenosaunee, and the Huron-Wendat, and thanks these nations for their care and stewardship over this shared land. Today, the City is committed to working with Indigenous peoples and all residents to pursue a united path of reconciliation. Learn more about the City's reconciliation initiatives . ",
    "pdfs": [
      {
        "text": "product specifications",
        "url": "https://www.cityofkingston.ca/media/gylpiprs/building_product-specification_reddens-contracting.pdf"
      },
      {
        "text": "product specifications",
        "url": "https://www.cityofkingston.ca/media/gylpiprs/building_product-specification_reddens-contracting.pdf"
      }
    ]
  },
  {
    "heading": "Deck Permits",
    "text": "A permit is required prior to construction for most decks. Apply online through DASH (Development and Services Hub), our online portal that gives you 24/7 access to municipal development services and active development activity. Apply Now ",
    "pdfs": []
  },
  {
    "heading": "Deck permit guide",
    "text": "You need a permit if your deck is higher than 600 mm above ground level. Submitting a complete application allows us to review your application within 10 business days. Constructing a deck before obtaining a Deck Permit is an offense. For any questions about the Deck Permit Application process, please contact the Building Services department. Application submission checklist To complete a Deck Permit Application online through DASH, make sure to follow these steps and provide the necessary documents: Excavation Framing Construct guard and floor systems using preservative-treated, pressure-treated, cedar lumber, or apply a suitable protective coating. Guard construction Stair and handrail construction Accessory structures If you plan to include an accessory structure like a shed that's larger than 10 square meters (108 square feet or about 10 feet by 10 feet) with plumbing, or 15 square meters (161 square feet) without plumbing in your project, you will need to submit a separate building permit application for these structures. Required inspections If you are the property owner or the contractor building a deck, you need to arrange these inspections: You can find the building inspector's name and phone number on the deck permit. Remember to schedule inspections at least 24 hours before you want them to happen. General provisions 10% of the lot area Note: Lot Coverage means the percentage of the lot area covered by: Lot Coverage excludes private sewage systems, uncovered steps, patios, swimming pools, decks, porches, balconies and bay windows as well as canopies and overhanging eaves which are 2.0 metres or more in height above the finished grade. ",
    "pdfs": [
      {
        "text": "SB-7 details",
        "url": "https://www.cityofkingston.ca/media/ng0f0cl4/building_guide_sb-7.pdf"
      }
    ]
  },
  {
    "heading": "Deck Zoning",
    "text": "Before making any decisions about building a deck or porch, please review the Zoning Bylaw . Contact Building Services 1211 John Counter Boulevard Kingston, ON K7K 6C7 buildingpermits @cityofkingston.ca Phone: 613-546-4291 ext. 3280 The City of Kingston acknowledges that we are on the traditional homeland of the Anishinabek, Haudenosaunee, and the Huron-Wendat, and thanks these nations for their care and stewardship over this shared land. Today, the City is committed to working with Indigenous peoples and all residents to pursue a united path of reconciliation. Learn more about the City's reconciliation initiatives . ",
    "pdfs": [
      {
        "text": "Zoning Bylaw",
        "url": "https://www.cityofkingston.ca/media/huup3ag5/planning_zoningbylaw_part1_section1-19.pdf"
      }
    ]
  },
  {
    "heading": "Fire Alarm Systems",
    "text": "Review the 2024 Ontario Building Code Fire Protection updates that come into effect on Jan. 1, 2025, and ensure compliance before submitting your building permit. Working fire alarm systems reduce the spread of fire and help people escape faster. If you have applied for a building permit, fire alarm system requirements are typically reviewed by an inspector. However, if you are installing or modifying life safety or fire suppression systems, like fire alarms, sprinklers, standpipes, or fixed extinguishing systems, you will need a mechanical and fire protection permit through DASH. This includes activities such as replacing fire alarm panels, adding new zones, or installing fire link systems, electromagnetic locks, or door hold-open devices. Apply Now ",
    "pdfs": []
  },
  {
    "heading": "Fire alarm systems and building permits",
    "text": "If you are an installer or property owner, learn in detail when you need a building permit and when you don't for fire alarm system construction activities. Installations must meet the requirements of the Ontario Building Code and you must get a compliance verification report for your work. The verification report must be maintained on site throughout the system's life. When is a building permit required? ",
    "pdfs": []
  },
  {
    "heading": "Additional engineering requirements",
    "text": "When a building permit is required for a fire alarm system, you must also get a Commitment to General Review (CTG) from an engineer. Additionally, an official engineer drawing (DWG) is required for the following activities: When is a building permit not required? ",
    "pdfs": []
  },
  {
    "heading": "Fire alarm systems guideline",
    "text": "The fire alarm systems guideline offers essential, active guidance for designing and installing fire alarm systems to ensure early fire detection and protect lives and property. Application submission checklist Please provide the following documentations and information: Prior to occupancy Provide the following documentation before occupancy for new buildings and existing projects applied for after January 1, 2020, but not yet occupied: For existing building renovations Contact Building Services 1211 John Counter Boulevard Kingston, ON K7K 6C7 buildingpermits @cityofkingston.ca Phone: 613-546-4291 ext. 3280 The City of Kingston acknowledges that we are on the traditional homeland of the Anishinabek, Haudenosaunee, and the Huron-Wendat, and thanks these nations for their care and stewardship over this shared land. Today, the City is committed to working with Indigenous peoples and all residents to pursue a united path of reconciliation. Learn more about the City's reconciliation initiatives . ",
    "pdfs": []
  },
  {
    "heading": "Heritage Permits",
    "text": "According to the Ontario Heritage Act , if you want to make changes to or remove anything on a heritage-designated property in a way that might affect its historical features, you need a permit. For any property that is designated as heritage or located in a heritage conservation district , the City Council or the Director of Heritage Services on behalf of Council, must formally approve your plans before you can receive a Building Permit . Apply online through DASH (Development and Services Hub), our online portal that gives you 24/7 access to municipal development services and active development activity. Apply Now ",
    "pdfs": []
  },
  {
    "heading": "What changes require council or staff approval?",
    "text": "These changes could involve: However, if Council defines your changes as maintenance, you don't need approval. This rule applies to all individually designated properties and those within Heritage Conservation Districts. You can find out more about the requirements around window or masonry work on your heritage property by referring to the Heritage Masonry Restoration Policy or Window Renovations in Heritage Buildings Policy . ",
    "pdfs": []
  },
  {
    "heading": "Heritage permit guide",
    "text": "Please check your property's heritage status. Is it designated under the Ontario Heritage Act, or is it just listed as a heritage property? Application submission checklist Application deadlines Applications to the Heritage Properties Committee are due by 4:30 p.m. on the dates listed below. All applications for Heritage Permit, Heritage Pre-Consultation or Other Heritage Act Requests are accepted through DASH.  ",
    "pdfs": []
  },
  {
    "heading": "Heritage Bylaw and Grants",
    "text": "The Heritage Bylaw aims to protect cultural heritage resources by outlining the framework for managing heritage properties in Kingston. The bylaw includes definitions, permit application processes, and delegation of authority information. As a Heritage property owner, you can apply for a heritage grant to help fund your conservation or restoration projects. Contact Heritage Services Department 216 Ontario Street Kingston, ON  K7L 2Z3 heritageplanning @cityokingston.ca Phone: 613-546-4291 ext. 1389 Fax: 613-542-9965 The City of Kingston acknowledges that we are on the traditional homeland of the Anishinabek, Haudenosaunee, and the Huron-Wendat, and thanks these nations for their care and stewardship over this shared land. Today, the City is committed to working with Indigenous peoples and all residents to pursue a united path of reconciliation. Learn more about the City's reconciliation initiatives . ",
    "pdfs": []
  },
  {
    "heading": "Larger Construction Permits",
    "text": "Review the 2024 Ontario Building Code Large Buildings updates that come into effect on Jan. 1, 2025, and ensure compliance before submitting your building permit. You need a building permit for construction or demolition of industrial, commercial, institutional and multi-unit residential projects, new buildings and/or addition for existing buildings. Starting any construction or demolition work without a permit is unlawful under the Ontario Building Code Act. We offer a fast-tracking permit process at an additional cost of $116.80 per hour, subject to approval by the Supervisor or Manager of Building Services. Apply online through DASH (Development and Services Hub), our online portal that gives you 24 / 7 access to planning, development, and building services and active development activity. Apply Now ",
    "pdfs": []
  },
  {
    "heading": "Prepare to apply for a permit",
    "text": "Before applying for a permit, review the following requirements. Zoning Bylaws Make sure your property complies with the requirements of the Zoning Bylaws. The applicable Zoning Bylaw outlines permitted uses and regulations for each property, including land/building use, setbacks, parking requirements, floor area, and building heights. If it is not possible to meet one or more of the Zoning Bylaw regulations, you may require a separate application to the Planning Department for a minor variance or re-zoning to amend the Zoning Bylaw. More information on zoning is available at the Planning and Building Department Counter at 211 John Counter Boulevard. Applicable Law Applicable Law is other regulations that require approval before issuing a building permit. Complete the Applicable Law Checklist and check the items that apply to your permit application and attach approval documents where applicable according to the Ontario Building Code. You may need approvals from outside agencies before obtaining a building permit. The most common Applicable Law approvals are: Ontario Building Code in objective-based format The Ontario Building Code, established under the Building Code Act, 1992, requires a building permit for constructing or altering any structure over 10m² (108 sq. ft.). It sets technical requirements for construction, renovation, demolition, changes in building use, and maintenance of on-site sewage systems, focusing on public health, fire protection, accessibility, and structural safety. The 2006/2012 Ontario Building Codes use an objective-based format to encourage innovation and flexibility in design and construction. Now, designers have the choice of applying for evaluation of an Alternative Solution that will achieve the same level of performance as its corresponding Acceptable Solution with respect to the underlying objectives and attributed functional statements. Requirements for designers Architects and professional engineers are qualified and registered by the Ontario Association of Architects and by the Association of Professional Engineers of Ontario, respectively, and are not required to be registered or qualified with the Ministry of Municipal Affairs and Housing. An Architect, Professional Engineer, or both must stamp and sign the drawings if applicable. A building permit cannot be issued if the hired designer or design firm is not qualified and registered. The Building Code requires that qualified and registered designers who take responsibility for design activities include the following information on any documents submitted: ",
    "pdfs": [
      {
        "text": "Applicable Law Checklist",
        "url": "https://www.cityofkingston.ca/media/ulklwc4r/building_applicable-law-checklist-2024.pdf"
      }
    ]
  },
  {
    "heading": "Types of permit applications and requirements",
    "text": "Review the different types of permits and apply for a permit to construct or demolish through DASH . If you need support in applying for a permit, please call at Building Services at 613-546-4291 ext. 3280 New buildings and additions to existing buildings Under the Building Code Act, the following information is required for a complete building permit application submission: Application forms and fees: Plans, specifications and additional documentation: Note: The construction, enlargement or alteration of every building or part of it as described in the Ontario Building Code, Division C, shall be designed and reviewed by an architect, professional engineer or both. Interior alterations to existing buildings Application forms and fees: Plans, specifications and additional documentation: Note: Applicant must retain a qualified designer to assess the existing premises and to prepare the plans. Even if no construction is proposed, upgrades to one or more of the following areas may be required: fire separation and fire resistance rating of demising walls, exits, door hardware, washroom facilities, HVAC system, exit signs and emergency lighting, fire alarm system. The Ontario Building Code, requires that an architect be retained where the construction affects structural integrity, fire separations, public corridor systems, exit enclosures, exterior walls and additions of new mezzanines. Change of use Section 10 of the Building Code Act requires a Change of Use building permit if the change increases hazard levels. Demolition permit Sections 7 and 8 of the Building Code Act require a Demolition Permit for removing a building or part of it, except for demolishing buildings on farms, which are exempt from permit requirements. Applicants must retain a professional engineer to undertake the general review of the project during demolition, if: For permit applications meeting these criteria, you must submit: For any other building submit: Conditional building permit Under the Building Code Act, the Chief Building Official may issue a conditional permit for any stage of construction if: After you submit your a building permit application, the authorities may consider a conditional permit under specific circumstances. Consider the following minimum information but we encourage you to always consult the Building Official as additional information may be required at any given stage. Occupancy prior to completion permit The Ontario Building Code allows for the occupancy of a building before its completion. A permit allowing occupancy of a building or a part of it before completion may be issued under the following conditions: Contact Us City of Kingston City Hall 216 Ontario Street Kingston, ON K7L 2Z3 Canada contactus@cityofkingston.ca Phone: 613-546-0000 The City of Kingston acknowledges that we are on the traditional homeland of the Anishinabek, Haudenosaunee, and the Huron-Wendat, and thanks these nations for their care and stewardship over this shared land. Today, the City is committed to working with Indigenous peoples and all residents to pursue a united path of reconciliation. Learn more about the City's reconciliation initiatives . ",
    "pdfs": [
      {
        "text": "Building Services Fee",
        "url": "https://www.cityofkingston.ca/media/vagdoh12/building-permit-fee-summary-january-1-2025.pdf"
      },
      {
        "text": "Building Services Fee",
        "url": "https://www.cityofkingston.ca/media/vagdoh12/building-permit-fee-summary-january-1-2025.pdf"
      }
    ]
  },
  {
    "heading": "Plumbing and Sewage System Permits",
    "text": "Review the 2024 Ontario Building Code Plumbing and Septic Systems updates that come into effect on Jan. 1, 2025, and ensure compliance before submitting your building permit. You must obtain a building permit from the City for constructing or altering an onsite sewage system with a daily capacity of 10,000 litres or less. Permits for systems over 10,000 litres per day are issued through the Ministry of Environment, Conservation and Parks. This permit application is reviewed for compliance with the Ontario Building Code, local zoning bylaws, and the Cataraqui Region Conservation Authority regulations. Constructing or altering a sewage system without a permit is illegal and subject to penalties, including a non-refundable administrative surcharge fee as per the City of Kingston Building Bylaw. Apply online through DASH (Development and Services Hub), our online portal that gives you 24/7 access to municipal development services and active development activity. Apply Now ",
    "pdfs": []
  },
  {
    "heading": "When to get a plumbing permit",
    "text": "Learn when you need to obtain a plumbing permit and when you don't. Plumbing independent of another building permit When you only want to make changes or add a new system, such as backflow prevention devices, sewer laterals or back water valve. Permits are required for both residential and non-residential buildings. Plumbing in conjunction with another building permit When applying for a new home, addition, or alteration building permit, there is no need for a separate sewage system record as we will review the sewage system in conjunction with the building permit. Plans and specifications should be uploaded to the building permit record. Additional fees for septic review may be charged. ",
    "pdfs": []
  },
  {
    "heading": "Sewage system permit guide",
    "text": "When you want to make changes or add to a building that already exists, we will check if the sewage system can handle the new fixtures being added. You need to fill out an application for review of performance level of existing on-site sewage system and upload it to your DASH record. Application submission checklist ",
    "pdfs": [
      {
        "text": "Class 2 Sewage Systems",
        "url": "https://www.cityofkingston.ca/media/aofc00cj/building_sewage_class2plansspecifications.pdf"
      }
    ]
  },
  {
    "heading": "Is your sewage system adjacent to a water body?",
    "text": "If you are planning to install a sewage system near a water body, you must also secure a permit from the Cataraqui Region Conservation Authority before obtaining a building permit for sewage systems within Cataraqui Region Conservation Authority jurisdiction. Contact them at 613-546-4228 for more information. ",
    "pdfs": []
  },
  {
    "heading": "Required inspections",
    "text": "The property owner or their contractor must use the online DASH portal to schedule inspections for: Contact Building Services 1211 John Counter Boulevard Kingston, ON K7K 6C7 buildingpermits @cityofkingston.ca Phone: 613-546-4291 ext. 3280 The City of Kingston acknowledges that we are on the traditional homeland of the Anishinabek, Haudenosaunee, and the Huron-Wendat, and thanks these nations for their care and stewardship over this shared land. Today, the City is committed to working with Indigenous peoples and all residents to pursue a united path of reconciliation. Learn more about the City's reconciliation initiatives . ",
    "pdfs": []
  },
  {
    "heading": "Pool Permits",
    "text": "Before you install a pool you must get a permit to make sure it is safe. To get a permit, apply for a “Pool Enclosure Permit” online through DASH. Hot tubs and swim spas with a cover that locks, do not need a permit or a fence enclosure, but they must follow the Zoning Bylaw. Apply Now ",
    "pdfs": []
  },
  {
    "heading": "Pool enclosure permit guide",
    "text": "You need a pool fence enclosure permit for outdoor water areas on your private property intended for swimming where the water depth can be more than 600 mm, including pools, hot tubs and wading pools. Even if you have a fence around your yard, you still need a pool enclosure permit to make sure the existing fence follows the bylaw. When you replace a pool enclosure, you also need a permit. However, you can repair and replace parts of your existing pool enclosure without getting a new permit. Application submission checklist Enclosure requirements Make sure the enclosures keep people out. They should be at least 1.2 m tall and follow these Fence Bylaw rules: Locked gates All enclosure gates should: If an accessory building or garage wall is part of the enclosure, any doors leading outside the pool area must also have self-closing, self-latching and locking devices. Above ground pools The vertical walls of an above-ground pool can be part of the pool enclosure if: You cannot use removable or swing-type ladders as part of the needed enclosure. Pool, hot tub and wading pool location Overhead lines The Ontario Electrical Safety Code mandates that overhead power lines must be at least 5 m above any pool equipment if they are within 5 m of the pool's edge. ",
    "pdfs": []
  },
  {
    "heading": "Fence Bylaw",
    "text": "We have regulations outlining specific requirements and standards for the construction and maintenance of fences around swimming pools. Take time to review our Fence Bylaw . Contact Building Services 1211 John Counter Boulevard Kingston, ON K7K 6C7 buildingpermits @cityofkingston.ca Phone: 613-546-4291 ext. 3280 The City of Kingston acknowledges that we are on the traditional homeland of the Anishinabek, Haudenosaunee, and the Huron-Wendat, and thanks these nations for their care and stewardship over this shared land. Today, the City is committed to working with Indigenous peoples and all residents to pursue a united path of reconciliation. Learn more about the City's reconciliation initiatives . ",
    "pdfs": []
  }
]