[
  {
    "heading": "Development Applications",
    "text": "Development applications include proposals for new lot creation, land use changes, or construction requiring approval under the Planning Act. These applications are submitted to the City of Kingston for review and approval, ensuring they comply with applicable land use policies and zoning regulations. Our Planning Services Department reviews and makes recommendations on development applications to Council. This process involves several steps and includes coordination with various stakeholders, including applicants. Some applications may not require a public meeting and staff may approve certain types of applications without Council involvement. Submit all applications through DASH . Learn how to use DASH . Council Review Process Learn about applications that require Council review and their process. Approvals Delegated to Staff Learn about applications where approvals are delegated to staff and the Site Plan Approval process. Pre-application Learn when you need a pre-application, the types, and the submission and meeting schedules. Committee of Adjustment Process Review the process for submitting an application. CLI ECA - Stormwater Learn about requirements and when you need a permit for stormwater infrastructure alterations. ",
    "pdfs": []
  },
  {
    "heading": "Planning and development review process",
    "text": "The rules for land use planning in Ontario come from the Planning Act . The Planning Act requires all land use planning decisions to be consistent with the Provincial Policy Statement . The Provincial Policy Statement gives provincial policy direction on key land use planning issues that affect our communities. The City’s land use policies and regulations are outlined in our Official Plan and Zoning Bylaws: You can also find the Official Plan and Zoning Bylaws information at the Planning Services offices, located at 1211 John Counter Blvd. ",
    "pdfs": []
  },
  {
    "heading": "Parkland dedication requirements",
    "text": "When land is developed or redeveloped, owners must convey (transfer) a portion of their land to the City for park or recreational use. It applies to all land within the city of Kingston. The Parkland Conveyance Bylaw sets out the requirements and procedures for developers to either provide physical land for parks or pay a specific amount of money (cash-in-lieu) that the City can use for park development elsewhere. Current rates These rates will only apply if the City determines that the development proposal does not require the land: ",
    "pdfs": []
  },
  {
    "heading": "Planning Applications Reports",
    "text": "Contact Building Services 1211 John Counter Boulevard Kingston, ON K7K 6C7 buildingpermits @cityofkingston.ca Phone: 613-546-4291 ext. 3280 Contact Planning Services 1211 John Counter Blvd. Kingston, ON K7L 4X7 planning@cityofkingston.ca Phone: 613-546-4291 ext. 3180 The City of Kingston acknowledges that we are on the traditional homeland of the Anishinabek, Haudenosaunee, and the Huron-Wendat, and thanks these nations for their care and stewardship over this shared land. Today, the City is committed to working with Indigenous peoples and all residents to pursue a united path of reconciliation. Learn more about the City's reconciliation initiatives . ",
    "pdfs": [
      {
        "text": "2025 Quarterly Report - July to September",
        "url": "https://www.cityofkingston.ca/media/53amio3b/planning-report-planning-applications-2025-q3.pdf"
      },
      {
        "text": "2025 Quarterly Report - April to June",
        "url": "https://www.cityofkingston.ca/media/nebdrjkg/planning-report-planning-applications-2025-q2.pdf"
      },
      {
        "text": "2025 Quarterly Report - January to March",
        "url": "https://www.cityofkingston.ca/media/xjgpyzj1/planning-report-planning-applications-2025-q1.pdf"
      },
      {
        "text": "2024 Quarterly Report - October to December",
        "url": "https://www.cityofkingston.ca/media/f42ft5ws/planning_report_planningapplications2024-q4.pdf"
      }
    ]
  },
  {
    "heading": "Council Review Process",
    "text": "Applications for Official Plan amendment, Zoning Bylaw amendment, Draft Plans of subdivision, Draft Plans for Condominium and Final Plans of Condominium go to the Council for a decision. Review the steps for Council Review Process: Step 1: Pre-application meeting Submit a pre-application online through DASH . During pre-application meetings, you will meet with City staff who will identify necessary approvals, supporting studies, drawings, and other submission requirements. We hold pre-application meetings virtually or in person at 1211 John Counter Boulevard. The assigned planner will confirm requirements and fees in the Pre-Application Report provided after the meeting. Step 2: Community Meeting For Zoning Bylaw amendment pre-applications, a Community Meeting is required as part of the pre-application process. The Planning Committee holds Community Meetings. A Community Meeting Report is prepared by the Manager of Development Approvals and includes copies of the Community Meeting Form (completed by the applicant) and mapping showing the site location and applicable Official Plan land use designation and zoning information. Step 3:  Submit your application After the completion of the pre-application process, submit your application online through DASH . To submit your application, ensure that you: We collect planning and engineering fees during the initial application submission. Some external agencies (e.g., conservation authority) charge additional fees for reviewing applications, payable directly to them. Step 4: Notice of complete / incomplete application Once your application is complete, we will issue a Letter of Complete Application within the 30-day limit set by the Planning Act. If your application is incomplete, you will receive a Letter of Incomplete Application listing the missing information. If you disagree, contact your assigned planner. You can appeal to the Ontario Land Tribunal if no agreement is reached. For Official Plans, Zoning Bylaw Amendments, and Plans of Subdivision, we must issue a public Notice of Complete Application within 15 days after a Letter of Complete Application has been issued. If possible, we combine this with the Public Meeting Notice. Otherwise, they're issued separately. Timelines for decisions begin once a complete application including the required application fees have been submitted. Step 5: Technical circulation After receiving your complete application, our assigned planner will send it to various City departments and external agencies. Depending on the application type and location of the property, this may include our Council, City departments, external groups, nearby towns, school boards, railway companies, utility companies and provincial and federal government departments. Once responses are received, the assigned planner puts together comments based on their review of technical feedback and planning policies. These comments are then shared with you or your agent. You will need to address staff and agency comments, provide any needed extra information, and send revised drawings to the assigned planner. They will then share this material with the right departments and agencies, working with you to resolve technical comments or concerns. This process continues until all comments have been resolved. For some larger projects, peer reviews of certain studies, like market studies or environmental impact assessments, may be necessary. You are responsible for the cost of peer reviews. Step 6: Public meeting The Planning Act mandates public meetings for certain types of applications. Public meeting notices are sent by mail, posted on-site, and may appear on our website or in the newspaper. The public meeting notice period for Official Plan and Zoning Bylaw amendment applications is 20 days before the meeting. No public meetings are required for Draft Plans of Subdivision or Final Subdivision/Condominium approval. Meetings are held on specific days each month. During the meeting, you or your agent present the proposed development, staff may offer information and Committee members may ask questions. The public can submit comments in writing or attend the meeting and provide oral comments. At the meeting, the Planning Committee receives a recommendation report from staff. This report includes a summary of the proposed application and site description, and an analysis of your proposal, relevant policies and bylaws, submitted studies, technical responses, and public input. It includes a recommendation from staff to approve the application as-is, with changes, or deny it. Step 7: Committee recommendation to council At the meeting, the Planning Committee discusses the application and makes recommendations to our Council. The Committee can suggest our Council approves the application as-is, with changes, or deny it. Sometimes, they might ask for more information before making a recommendation. Step 8: Council decision The Planning Committee's recommendations go to our Council for a decision. Our Council can accept, change, reject or send them back for more information. If our Council approves an application, the related bylaws are passed at that meeting and forwarded to the Mayor for approval and signing of the Mayoral Decision. Step 9: Notice of decision The Planning Act requires us to send out notices of Council’s decisions. The notice is sent out within 15 days of Council’s decision and includes the deadline for any appeals to be submitted. Step 10:  Appeal period for decision of council The Planning Act allows for appeals in planning decisions. If you spoke at the public meeting or sent a written comment before the decision, you can appeal Council’s decision to the Ontario Land Tribunal . You need to do this within the time mentioned in the notice. You also need to say which part of the decision you're appealing and why. If an application is appealed to the Ontario Land Tribunal, there may be a hearing to decide the appeal. Learn more about the Ontario Land Tribunal and its processes. Step 11: Building permit and construction To get a building permit, apply online through DASH . This permit gives you permission to start construction or demolition. We review your plans to ensure they follow the Ontario Building Code, our Zoning Bylaws, and other rules. You will also pay development charges at this stage. Building permits ensure that construction follows the rules and safety standards. They protect your interests and the community. Our staff can help you with information and solutions to construction issues. You are responsible for following all building requirements, even if someone else gets the permit for you. You can find more information about the building permit process in the Citizen's Guide to land use planning from the Ministry of Municipal Affairs and Housing. Contact Building Services 1211 John Counter Boulevard Kingston, ON K7K 6C7 buildingpermits @cityofkingston.ca Phone: 613-546-4291 ext. 3280 Contact Planning Services 1211 John Counter Blvd. Kingston, ON K7L 4X7 planning@cityofkingston.ca Phone: 613-546-4291 ext. 3180 The City of Kingston acknowledges that we are on the traditional homeland of the Anishinabek, Haudenosaunee, and the Huron-Wendat, and thanks these nations for their care and stewardship over this shared land. Today, the City is committed to working with Indigenous peoples and all residents to pursue a united path of reconciliation. Learn more about the City's reconciliation initiatives . ",
    "pdfs": []
  },
  {
    "heading": "Pre-application",
    "text": "You must submit a pre-application through DASH for specific application types: ",
    "pdfs": []
  },
  {
    "heading": "Standard pre-application",
    "text": "Standard pre-applications are confidential until a formal application is submitted. Standard pre-applications apply to: ",
    "pdfs": []
  },
  {
    "heading": "Zoning Bylaw Amendment",
    "text": "The Zoning Bylaw Amendment pre-applications include applications for Zoning Bylaw Amendment and a Zoning Bylaw Amendment submitted concurrently with an Official Plan Amendment or a Draft Plan of Subdivision. These pre-applications are not confidential. ",
    "pdfs": []
  },
  {
    "heading": "Site Plan Control",
    "text": "The Site Plan Control pre-application includes applications for Site Plan Control except for minor Site Plan applications and Site Plan modifications. In advance of a Zoning Bylaw amendment pre-application or a Site Plan Control pre-application, applicants may submit an optional Standard pre-application. Apply Now ",
    "pdfs": []
  },
  {
    "heading": "Pre-application submission and meeting schedule",
    "text": "During pre-application meetings, you will meet with City staff who will identify necessary approvals, supporting studies, drawings, and other submission requirements. We hold pre-application meetings virtually or in person at 1211 John Counter Boulevard. The assigned planner will confirm requirements and fees in the Pre-Application Report provided after the meeting. 2026 submission and pre-application meetings schedule Contact Building Services 1211 John Counter Boulevard Kingston, ON K7K 6C7 buildingpermits @cityofkingston.ca Phone: 613-546-4291 ext. 3280 Contact Planning Services 1211 John Counter Blvd. Kingston, ON K7L 4X7 planning@cityofkingston.ca Phone: 613-546-4291 ext. 3180 The City of Kingston acknowledges that we are on the traditional homeland of the Anishinabek, Haudenosaunee, and the Huron-Wendat, and thanks these nations for their care and stewardship over this shared land. Today, the City is committed to working with Indigenous peoples and all residents to pursue a united path of reconciliation. Learn more about the City's reconciliation initiatives . ",
    "pdfs": []
  },
  {
    "heading": "Approvals Delegated to Staff",
    "text": "City Council has delegated approval authority for Site Plan Control, Final Plan of Subdivision, and Consent applications to staff. However, there is a provision for a bump-up to our Planning Committee or Council. The bump-up request may be made by Council through a Council motion. In cases of disputed Consent applications, or Consent applications submitted concurrently with a minor variance application, the Committee of Adjustment handles them. Staff or the applicant can also request a bump-up if there is a disagreement with municipal conditions or if disputes arise between staff and the applicant regarding required works. A bump-up request impacts processing timelines because it involves staff preparing a report for the Committee or Council and discussing the application at a meeting. ",
    "pdfs": []
  },
  {
    "heading": "Site plan approval process",
    "text": "Site plan approval is a required step for many land development projects before a building permit can be granted. The specific types of development that need site plan control are detailed in the Site Plan Control Bylaw . Site plan control, which is governed by Section 41 of the Ontario Planning Act, empowers us to review key aspects of a project. This includes building placement, parking, site design, storm water management, and more. Kingston's Site Plan Control Guidelines outline the application process, requirements, reports and technical details. ",
    "pdfs": [
      {
        "text": "Kingston's Site Plan Control Guidelines",
        "url": "https://www.cityofkingston.ca/media/o54lrbqr/planning-site-plan-control-guidelines.pdf"
      }
    ]
  },
  {
    "heading": "Site plan approval process guideline",
    "text": "We assign a City planner to each application. That planner collaborates with the applicant to handle technical matters, set up meetings and address any issues. The planner serves as the main contact for the applicant throughout the application process. Once we approve the application, we and the property owner make a legal agreement. Usually, you cannot get a building permit until you meet all the site plan control requirements and get the final approval. In certain situations, and based on timing, we might consider a partial building permit to start the foundation work if you request it. All technical departments will review this request before deciding. Step 1: Pre-application A pre-application submission is optional, but recommended prior to the submission of a site plan control application. If you choose to submit a pre-application you must do it online through DASH. The pre-application helps you figure out what approvals and reports you need for site plan control. This might include studies on traffic impact, tree preservation, stormwater management, parking, noise and more. It also identifies any external agencies you should contact such as the Cataraqui Region Conservation Authority. The assigned planner will confirm requirements and fees in the Pre-Application Report provided after the meeting. Note for prior approvals modifications If you want to make changes to a property that already has site plan control approval, you might need a s ite p lan mo dification approval. This could also involve an updated agreement and more financial security, depending on the changes. Step 2: Application submission Following your pre-application, you can submit your site plan control application through DASH . Please download and complete the Site Plan Accessibility Checklist , and upload it to your application in DASH. This is mandatory for all applications. Additionally, please upload all materials related to your site plan control, such as: The complete application fee , that covers both planning and engineering costs, is due when you submit your application for approval. Step 3: Public notice As part of site plan control, the assigned planner creates an 11x17-inch sign that you need to put on the property. This sign advises the public that you have applied for site plan control and what the proposal is. It also gives the planner’s contact details in case more information is needed. You are responsible for putting up the signs. Step 4: Technical circulation The planner in charge of your project will share the submitted plans and studies with relevant City departments and outside agencies as part of a technical review. Additionally, we have a committee that supports the review of site plan control applications to ensure that the proposed development meets all accessibility requirements . A complete submission is crucial for departments to review all relevant materials and offer feedback . Step 5: Technical responses The planner will forward technical review comments to you and your agent. To address these comments, you may be required to submit additional information and updated drawings to the planner, who will share them with relevant departments and agencies for assessment. The planner will work with you to address comments and schedule meetings if needed. Step 6: Site plan control approval The Director of Planning Services can approve site plan control applications, but they may go to the Planning Committee if requested by Council through a Council motion. In these situations, the Planning Committee receives an information report on the application, but the authority to approve the application rests with the Director of Planning Services. This is the process used for site plan control approval: Note on conditions of approval We can include conditions of approval in the site plan control agreement. If you do not agree with the conditions, you can appeal to the Ontario Land Tribunal . Step 7: Sign removal upon completion As an applicant, you must remove all signs from the property once site plan control approval is complete. Step 8: Building permits After receiving final site plan control approval, you may apply for a buildings permit, and prepare the project for the construction phase. Step 9: Release of securities After finishing construction, you can ask to reduce or release the financial securities based on the conditions in the site plan control agreement. Contact Building Services 1211 John Counter Boulevard Kingston, ON K7K 6C7 buildingpermits @cityofkingston.ca Phone: 613-546-4291 ext. 3280 Contact Planning Services 1211 John Counter Blvd. Kingston, ON K7L 4X7 planning@cityofkingston.ca Phone: 613-546-4291 ext. 3180 The City of Kingston acknowledges that we are on the traditional homeland of the Anishinabek, Haudenosaunee, and the Huron-Wendat, and thanks these nations for their care and stewardship over this shared land. Today, the City is committed to working with Indigenous peoples and all residents to pursue a united path of reconciliation. Learn more about the City's reconciliation initiatives . ",
    "pdfs": [
      {
        "text": "Site Plan Accessibility Checklist",
        "url": "https://www.cityofkingston.ca/media/txhdvf1a/site-plan-accessiblity-checklist-web-accessible.pdf"
      }
    ]
  },
  {
    "heading": "CLI ECA - Stormwater",
    "text": "The Consolidated Linear Infrastructure Environmental Compliance Approval for the City of Kingston Stormwater Management System (CLI ECA SWM) streamlines the ECA process and delegates approval authority to the City from the Province for all pre-authorized stormwater infrastructure alterations. For information about CLI ECA permits for the municipal sewage collection system, contact Utilities Kingston at 613-546-1181 ext. 2339. Permissions for sanitary infrastructure changes are also managed by Utilities Kingston. Learn more about Drinking Water Works Permit Watermain Approvals . When is a CLI ECA SWM permit required? If the project includes changes such as additions, modifications, replacements and or extensions to the City’s stormwater management system under one of the following scenarios: Pre-authorized alternations and exemptions are listed in the CLI ECA SWM Agreement , Schedule D Sections 3.1, 4.3, 5.3 and 6.3. Contact Us to request a copy of the document. ",
    "pdfs": []
  },
  {
    "heading": "How to apply for a permit",
    "text": "Before you apply for a permit all development applications must first go through the City’s Development Review Process regardless of the applicable ECA/EASR process. To facilitate final approval, the requirements of the CLI ECA SWM application should be incorporated into the design during the City’s Development Review for preliminary screening. You must review the details on this page, including the design standards and guidelines, and ensure you have all the requirements before applying. ",
    "pdfs": []
  },
  {
    "heading": "Application checklist",
    "text": "How to complete the forms Application fees The fees calculated on the CLI ECA Permit Application Fee Form cover the City’s technical review and permitting process. These fees have been approved under the City's Fees and Charges Bylaw . Follow the payment instructions on the form. Do not submit payment information via email or other electronic means. If you have questions regarding the application or fees contact the Senior Stormwater Technologist at 613-546-4291 , ext. 3192 ",
    "pdfs": [
      {
        "text": "Application Checklist form",
        "url": "https://www.cityofkingston.ca/media/me1b4gre/engineering_form_clieca_applicationchecklist.pdf"
      },
      {
        "text": "CLI ECA Permit Application Fee Form",
        "url": "https://www.cityofkingston.ca/media/xshbpyob/engineering_form_clieca_permitapplicationfee-jan2026.pdf"
      }
    ]
  },
  {
    "heading": "Submissions",
    "text": "Submit the CLI ECA SWM application by email to Engineering Services: Submissions to the MECP Applicants will need to submit to the Ministry of the Environment Conservation and Parks (MECP) directly for changes to the following: If the work qualifies for direct submission to the MECP, refer to the Ministry’s Guide to applying for an environmental compliance approval . Online registration in EASR Certain routine and lower-risk activities require applicants to register online in the Environmental Activity and Sector Registry (EASR). In these cases, an ECA is not required. To find out when to apply for an ECA or when to self-register for an EASR , check the Ministry’s website or contact them directly: ",
    "pdfs": []
  },
  {
    "heading": "Design standards and guidelines",
    "text": "Designs must reflect the most conservative of the standards and guidelines listed below. Justify the use of any other standards and guidelines in the design report or brief (with sources cited), as this may require a Direct ECA Submission to the MECP. General design and technical specifications Outlets Specific standards for stormwater outlets. Stormwater Management Criteria Document (TRCA, 2012) Inspection and maintenance Requirements for inspections and maintenance. Erosion and sediment control Erosion and sediment must be controlled within these standards. ",
    "pdfs": [
      {
        "text": "Subdivision Development Guidelines and Technical Standards",
        "url": "https://www.cityofkingston.ca/media/k3gltxg1/planning_guide_subdivision_techstandardsguide.pdf"
      },
      {
        "text": "MECP Design Criteria for Sanitary Sewers, Storm Sewers and Forcemains for Alterations Authorized under Environmental Compliance Approval",
        "url": "https://www.cityofkingston.ca/media/apfaaoks/clieca_designcriteriaforecas.pdf"
      },
      {
        "text": "Stormwater Management Criteria Document",
        "url": "https://trcaca.s3.ca-central-1.amazonaws.com/app/uploads/2021/10/20103017/SWM-Criteria-2012.pdf"
      }
    ]
  },
  {
    "heading": "Technical review process",
    "text": "A detailed technical review is required to assess the: Additional information request During the detailed review, the reviewer may determine that more information is necessary for a proper assessment of the application. The reviewer will request this additional information from the applicant and/or the applicant’s agent. Approval process ",
    "pdfs": []
  },
  {
    "heading": "Additional Resources",
    "text": "Default Subdivision Agreement Clauses Summary of CLI ECA related clauses that may be added to subdivision agreement. Related documents Stormwater Management Data View an inventory of all identified municipal stormwater management system infrastructure assets from our Open Data Kingston. Ontario Regulations Contact Us City of Kingston City Hall 216 Ontario Street Kingston, ON K7L 2Z3 Canada contactus@cityofkingston.ca Phone: 613-546-0000 The City of Kingston acknowledges that we are on the traditional homeland of the Anishinabek, Haudenosaunee, and the Huron-Wendat, and thanks these nations for their care and stewardship over this shared land. Today, the City is committed to working with Indigenous peoples and all residents to pursue a united path of reconciliation. Learn more about the City's reconciliation initiatives . ",
    "pdfs": [
      {
        "text": "Summary of CLI ECA related clauses",
        "url": "https://www.cityofkingston.ca/media/jtrlc4yi/engineering_clieca_subdivisionagreementclause.pdf"
      },
      {
        "text": "Stormwater Annual Performance Report",
        "url": "https://www.cityofkingston.ca/media/y0zleodl/engineering-report-stormwaterannualperformancereport2024.pdf"
      },
      {
        "text": "Stormwater Annual Performance Report",
        "url": "https://www.cityofkingston.ca/media/usabibb2/engineering_report_stormwaterannualperformancereport2023.pdf"
      },
      {
        "text": "Core Asset Management Plan",
        "url": "https://www.cityofkingston.ca/media/lvqja2oz/engineering_plan_coreassetmanagementplan_2022.pdf"
      },
      {
        "text": "Kingston Watershed Map(2022)",
        "url": "https://www.cityofkingston.ca/media/e5fpygih/engineering_map_clieca_watershedmap.pdf"
      }
    ]
  },
  {
    "heading": "Committee of Adjustment Process",
    "text": "The Committee of Adjustment is made up of seven members appointed by City Council, including five resident members and two Councillor members.  This committee can give permission for changes to the zoning rules, allow changes to existing legal non-conforming uses, and approve a Consent application to allow for the creation of a new lot from a larger property. The Committee's approval is also needed for long-term agreements on land, like leases, easements or mortgages lasting more than 21 years. The Committee meets monthly at City Hall. 2026 Committee meeting and submission dates Apply Now ",
    "pdfs": []
  },
  {
    "heading": "Applications for consent",
    "text": "The Planning Act requires permission to split a piece of land and create a new lot. This is known as land severance. It allows us to ensure that new lots follow planning rules laid out in the Official Plan and the Zoning Bylaws. When is a consent required? You might need consent for several reasons, including: How to sever a property If you want to split your property for selling it, getting a mortgage, or leasing it for more than 21 years, you need to ask for permission. This permission process is often called \"consent to sever”. ",
    "pdfs": []
  },
  {
    "heading": "Applications for minor variance",
    "text": "A minor variance is when you ask for a small change to the zoning rules. If approved, it allows you to get a building permit even if your property does not exactly match the regulations in the Zoning Bylaw. There are four tests for a minor variance under the Planning Act: An application must pass all four tests to be considered a minor variance. ",
    "pdfs": []
  },
  {
    "heading": "Committee of Adjustment application process",
    "text": "The Committee of Adjustment process takes around 60 to 90 days from when you apply to Planning Services. All applications must be submitted online through DASH . Step 1: Pre-application meeting Before applying for a Minor Variance or Consent, applicants must apply for a pre-application and meet with Planning Services staff to review application details. During pre-application meetings, you will meet with City staff who will identify necessary approvals, supporting studies, drawings, and other submission requirements. We hold pre-application meetings virtually or in person at 1211 John Counter Boulevard. The assigned planner will confirm requirements and fees in the Pre-Application Report provided after the meeting. Step 2: Payment of fees You are required to pay application fees for each Minor Variance and Consent application along with your application submission. If significant changes are made to the application during processing, and it is required to be re-evaluated by technical staff, then additional fees may apply. Step 3: Circulation of applications We send Minor Variance and Consent applications to different City departments and outside organizations for review. This may include Building Services, Engineering Services, Transportation Services, and Utilities Kingston. If your proposal is near wetlands, watercourses or environmentally sensitive lands, we may also send it to the Cataraqui Region Conservation Authority for their input. Step 4: Notifying neighbours Before the public meeting, we will send a notice to property owners within 60 metres of the property for which the Minor Variance or Consent is proposed. This notice includes details about the application and the date and time of the Committee of Adjustment meeting. The public meeting notice period is as follows: We will also provide signs to you to post on your property. Failure to post the sign may result in delays in your application process or the cancellation of scheduled public meetings. Step 5: Site inspections The committee members and our planning staff will typically conduct site inspections. Step 6: Public Meeting The Committee meets monthly at City Hall. During the meeting, you or your agent present the proposed application, staff may offer information and Committee members may ask questions. The public can submit comments in writing or attend the meeting and provide oral comments. At the meeting, the Committee receives a recommendation report from staff. If the report recommends approval of the application, any conditions to the approval will be included. The decisions are announced at the meeting and sent in writing to the applicant and to anyone who requested the decision within 10 days. Can anyone appeal the decision? The decisions made by the Committee of Adjustment can only be challenged by the applicant, the Minister, or certain people or groups as noted in the Planning Act. Contact Building Services 1211 John Counter Boulevard Kingston, ON K7K 6C7 buildingpermits @cityofkingston.ca Phone: 613-546-4291 ext. 3280 Contact Planning Services 1211 John Counter Blvd. Kingston, ON K7L 4X7 planning@cityofkingston.ca Phone: 613-546-4291 ext. 3180 The City of Kingston acknowledges that we are on the traditional homeland of the Anishinabek, Haudenosaunee, and the Huron-Wendat, and thanks these nations for their care and stewardship over this shared land. Today, the City is committed to working with Indigenous peoples and all residents to pursue a united path of reconciliation. Learn more about the City's reconciliation initiatives . ",
    "pdfs": []
  }
]