[
  {
    "heading": "Line Fence Disputes",
    "text": "The provincial Line Fences Act provides a process for you to resolve line fence disputes with your neighbours. It applies when you want to build, repair, or maintain a fence on your shared property line, but you cannot agree on the type of fence you should use and / or how to split the costs. A line fence shows where one person's land ends and a neighbour's land begins. ",
    "pdfs": []
  },
  {
    "heading": "Dealing with neighbour fence disputes",
    "text": "Before you begin an arbitration process, you should talk to your neighbours to try and reach an agreement. If you cannot agree, you can request the presence of a fence viewer to help resolve the dispute. According to the Line Fences Act, you can involve fence viewers in only two situations: Note: Fence viewers cannot help you with disputes if construction has already started or if there is a disagreement about where the property line is located. The dispute resolution process requires three fence viewers, and each one must receive a daily remuneration. Fence viewings cannot take place during the winter, between November 1 of one year and March 31 of the following year. You may wish to seek legal advice concerning any legal remedy you may have against the adjoining property owner. ",
    "pdfs": []
  },
  {
    "heading": "How to apply for a fence viewer",
    "text": "By Mail By Email Once the City Clerk receives your application and the required fee, we will schedule a date and time for the arbitration hearing. The City Clerk and the fence viewers will notify all property owners at least one week before the hearing. Contact Us City of Kingston City Hall 216 Ontario Street Kingston, ON K7L 2Z3 Canada contactus@cityofkingston.ca Phone: 613-546-0000 Contact City's Clerk Department cityclerk@cityofkingston.ca Phone: 613-546-4291 ext. 1207 The City of Kingston acknowledges that we are on the traditional homeland of the Anishinabek, Haudenosaunee, and the Huron-Wendat, and thanks these nations for their care and stewardship over this shared land. Today, the City is committed to working with Indigenous peoples and all residents to pursue a united path of reconciliation. Learn more about the City's reconciliation initiatives . ",
    "pdfs": []
  }
]