[
  {
    "heading": "Memorials and Commemorations",
    "text": "We take pride in our history, which our motto, \"Where History and Innovation Thrive,\" reflects. We have many commemorations and memorials on our properties that help us connect with our community's past. Different city departments manage various forms of commemorations, such as dedicating trees and benches, making proclamations and raising flags. Some tangible commemorations, like plaques, statues, monuments, certificates and mementos, are now part of our civic collection of artifacts and works of art. You can request tangible commemorations too. ",
    "pdfs": []
  },
  {
    "heading": "Memorial trees",
    "text": "Planting a tree in a park is a nice way to remember someone or celebrate a special time. We will take care of everything, including planting the tree (you can select the type), adding a small sign and putting it in one of our parks. Create a MyKingston account to easily apply for a memorial tree online and we will contact you to start the process. Request Memorial Tree How much does it cost? The cost for a tree is $633.41 plus HST. Fees are set each year through our Fees and Charges Bylaw . How does it work? Types of trees available You can choose a tree from this list, but it depends on what the nursery has available: Native Species: Non-native Species: Plaque details The plaque is usually black and measures 5 inches by 51/4 inches. You can include a message; we recommend a character count of 250. We install the plaques and pedestals at the same time as the memorial tree. ",
    "pdfs": []
  },
  {
    "heading": "Memorial benches",
    "text": "Our memorial bench program lets you place a plaque on a bench in a public park to remember loved ones. Each bench can have up to two separate plaques for different dedications, with terms available in 10- and 20-year commitments. Note: memorial benches are not available in Confederation Park. Create a MyKingston account to easily apply for a memorial bench online and we will contact you to start the process. Request Memorial Bench How much does it cost? The cost for a memorial bench is $1101.28 plus HST for 10 years. If you wish to extend for another 10 years, the cost is $734.25. Fees are set each year through our Fees and Charges Bylaw . At the end of the term, you can request that the plaque be returned to you. Plaque details The standard plaque side is 2 inches by 6 inches, so it is recommended the character count be between 60 to 80 characters. ",
    "pdfs": []
  },
  {
    "heading": "Light up City Hall",
    "text": "Applications for an illumination taking place after Jan. 1, 2026, will be reviewed every three months. Approximately 15-20 spots will be available each quarter. This change results from updates to the City's Illumination Policy. The lights on First Capital Place are used to celebrate, remember, support and raise awareness about local history, special events and important causes in the community. These lights also highlight Kingston City Hall as a national historic site and share stories that matter to our community. View the upcoming lighting of City Hall events . Public requests to illuminate City Hall and Market Square will be for one night from dusk until dawn. Note: The “I in Kingston” sign is outside the scope of our Illumination Policy and is not included in the current illumination application. Create a MyKingston account to easily apply for a light up online and we will contact you to start the process. For more information, please call 613-546-4291 ext. 1219 Request Light Up Illumination requirements To request to illuminate the City Hall and Market Square, you need to meet these conditions: Requests are processed in the order they are received, provided they meet these conditions. Requests will not be accepted if they: We can also say no or cancel requests for other reasons, like: 2026 application process Submit your application at your earliest convenience. We will review your application once the deadline for that quarter has passed. We will email you within three weeks after the application deadline to inform you whether your application has been approved. You can submit as many applications as you like per calendar year. Keep in mind that your illumination must be connected to a specific day of observance. The purpose of the policy is to represent the diversity of Kingston's communities; therefore, we cannot guarantee that every application will be approved. 2026 application deadlines Annual illuminations In addition to community applications, the occasions listed below are illuminated every year. We selected these annual illuminations because they align with our strategic priorities and our equity, diversity, and inclusion principles. Additionally, as part of the City's commitment to reconciliation with Indigenous Peoples and communities, City Hall will be illuminated monthly as a visible commitment to community healing and in honour of the victims of residential schools. ",
    "pdfs": []
  },
  {
    "heading": "Flag raising",
    "text": "Flags or pennants can be shown at Confederation Basin to let people know about things like special holidays, events from different cultures and charitable initiatives. Flag raising requires approval from the City Clerk or Council.  Submit your application at least two weeks before to the requested display date and provide the related flag at least five days in advance. Create a MyKingston account to easily apply for a light up online and we will contact you to start the process. Request Flag Raising Guidelines for approving flag display requests For more information call 613-546-4291 ext. 1209. Pre-approved community flag raisings We will automatically raise flags on certain dates that are important to our community, including: Half-masting Flags at City-owned places can be lowered halfway to show respect on designated days, such as: Flags can also be lowered halfway when certain individuals pass away, like the Monarch or Royal Family members, Canadian Prime Ministers, government representatives, City employees, Kingston Police officers and soldiers from Canadian Forces Base Kingston. Upcoming flag raisings View the upcoming flag raisings . Contact Us City of Kingston City Hall 216 Ontario Street Kingston, ON K7L 2Z3 Canada contactus@cityofkingston.ca Phone: 613-546-0000 The City of Kingston acknowledges that we are on the traditional homeland of the Anishinabek, Haudenosaunee, and the Huron-Wendat, and thanks these nations for their care and stewardship over this shared land. Today, the City is committed to working with Indigenous peoples and all residents to pursue a united path of reconciliation. Learn more about the City's reconciliation initiatives . ",
    "pdfs": []
  }
]