[
  {
    "heading": "Open Air Fire Permits",
    "text": "All 2025 Open Air Fire Permits expired on December 31, 2025. Please renew your permit or apply for a new Open Air Fire Permit for 2026. If you wish to have an outdoor fire in Kingston, you must obtain a permit from Kingston Fire and Rescue to ensure fire safety. These permits are free for property owners and tenants and valid for an entire year. ",
    "pdfs": []
  },
  {
    "heading": "Permit types",
    "text": "There are various permits available depending on the type of fire you plan to have. Before applying for a permit, review the regulations for each type of fire and determine your zone (zone one or zone two) by referring to the Open Air Fire Ban Status map. Find information about what permits that are available per zone in the following map. Please note that approval of permits depends on the Fire Ban Status on each zone. Open the full page Open Air Fire Ban Status map . ",
    "pdfs": []
  },
  {
    "heading": "Open air fireplace permit",
    "text": "Available in zone one and zone two. An open air fireplace means a manufactured, non-combustible, enclosed container designed to hold a small fire for decorative purposes, the size of which does not exceed 1 metre in any direction, and includes, but is not limited to, a chiminea. The fireplace must be at least 3 metres from any building, structure, hedge, fence, overhead wiring, trees, other combustible materials, or the lot line. Terms and conditions Read terms and conditions, and c reate a MyKingston account to easily apply for an open air fireplace permit . ",
    "pdfs": []
  },
  {
    "heading": "Open air appliance fire permit",
    "text": "Available in zone one and zone two. An open air appliance fire refers to a wood-burning device that has received approval from CAN/ULC (Underwriters Laboratories of Canada). The fireplace must be at least 5 metres from any building, structure, hedge, fence, overhead wiring, trees, other combustible materials, or the lot line. Please note: Devices with mechanical shut-offs are exempt from requiring a permit, such as propane or natural gas appliances, as well as grilling or cooking fires using smokers, barbecues, masonry barbecues, charcoal appliances, hibachis, and contained pizza ovens. Terms and conditions Read terms and conditions, and create a MyKingston account to easily apply for an open air appliance fire permit . ",
    "pdfs": []
  },
  {
    "heading": "Campfire permit",
    "text": "Limited to zone one. Campfires are allowed in firepits that are made from materials like non-combustible metal, masonry, ceramic, a stone circled area or a pit in the ground. These campfires must be on private property and are only allowed in rural fire zone one. The campfire must be at least 5 metres from any building, structure, hedge, fence, overhead wiring, trees, other combustible materials, or the lot line. Terms and conditions Read terms and conditions, and create a MyKingston account to easily apply for an campfire permit . ",
    "pdfs": []
  },
  {
    "heading": "Brush fire permit",
    "text": "Limited to zone one. Restricted to rural fire zone one, the Fire Chief cannot approve brush fires exceeding three meters (10 feet) in all directions. Terms and conditions Read terms and conditions, and create a MyKingston account to easily apply for an brush fire permit . ",
    "pdfs": []
  },
  {
    "heading": "Campground fire permit",
    "text": "Limited to zone one. The owner of the campground, not individual campers, must apply for the permit for fires within the campground, restricted to rural fire zone one. Terms and conditions Read terms and conditions, and create a MyKingston account to easily apply for an campground permit . ",
    "pdfs": []
  },
  {
    "heading": "Special event fires permits",
    "text": "Available in zone one and zone two. Special events include, but are not limited to, school programs, community organizations such as Girl/Boy Scouts, and 4H Club, and events organized throughout the City of Kingston. Terms and conditions Read terms and conditions, and create a MyKingston account to easily apply for an special event fire permit . ",
    "pdfs": []
  },
  {
    "heading": "Agricultural permit",
    "text": "Limited to zone one. Registered farming businesses located in zone one can conduct agricultural fires. The size of these fires should not exceed six meters (20 feet) in any direction, unless approved by the Fire Chief. Agricultural fires must be at least 90 metres away from any building, hedge, fence, overheard wires, trees, other combustible materials, or the lot line. Terms and conditions Read terms and conditions, and create a MyKingston account to easily apply for an agricultural fire permit . ",
    "pdfs": []
  },
  {
    "heading": "Fire ban status",
    "text": "A fire ban status is a temporary measure put in place to prevent human-caused fires when the fire hazard is extreme or when there are limited firefighting resources. The restrictions and safety measures vary depending on whether it is a partial fire ban or a total fire ban. ",
    "pdfs": []
  },
  {
    "heading": "No fire ban",
    "text": "Open fires are allowed. Regular safety measures and individual permit requirements apply. ",
    "pdfs": []
  },
  {
    "heading": "Partial fire ban",
    "text": "During a partial fire ban, setting agricultural fires, brush fires, and fireworks is prohibited. ",
    "pdfs": []
  },
  {
    "heading": "Total fire ban",
    "text": "During a total fire ban, setting fireworks or any type of open air fires, including campfires, outdoor appliances and fireplaces, agricultural fires, brush fires, and special event fires is prohibited. Contact Us City of Kingston City Hall 216 Ontario Street Kingston, ON K7L 2Z3 Canada contactus@cityofkingston.ca Phone: 613-546-0000 The City of Kingston acknowledges that we are on the traditional homeland of the Anishinabek, Haudenosaunee, and the Huron-Wendat, and thanks these nations for their care and stewardship over this shared land. Today, the City is committed to working with Indigenous peoples and all residents to pursue a united path of reconciliation. Learn more about the City's reconciliation initiatives . ",
    "pdfs": []
  },
  {
    "heading": "Open Air Fire Ban Status Map",
    "text": "The City of Kingston acknowledges that we are on the traditional homeland of the Anishinabek, Haudenosaunee, and the Huron-Wendat, and thanks these nations for their care and stewardship over this shared land. Today, the City is committed to working with Indigenous peoples and all residents to pursue a united path of reconciliation. Learn more about the City's reconciliation initiatives . ",
    "pdfs": []
  }
]