[
  {
    "heading": "Short-Term Rental Licensing",
    "text": "Starting Jan. 1, 2026, the Ontario Fire Code now requires carbon monoxide (CO) alarms in all homes, including short-term rentals. You must install CO alarms near sleeping areas and on every floor of the house, even if there are no bedrooms. Alarms can be hardwired, battery-operated, or plug-in. Find out more about the changes to the Ontario Fire Code . Regulating short-term rental properties helps us ensure the safety of each rental property and provides residents with the opportunity to earn extra income while supporting the tourism industry of Kingston. Short-term rentals are subject to a Municipal Accommodation Tax. This means, if you use a short-term rental in the City of Kingston you must pay an additional fee added to your accommodation that goes to the municipality. These funds are reinvested in tourism products and promotion to help the City grow its tourism industry without increasing local taxes. Learn more about the Municipal Accommodation Tax . Learn more about our regulations in our Short-Term Rental Bylaw . ",
    "pdfs": []
  },
  {
    "heading": "Apply for a new or renew your licence",
    "text": "Follow the steps below to apply for your short-term rental licence. If your application is approved, you will need to pay the licence fee to complete the process. We will notify you when your licence is ready. Short-Term Rental Licences are valid from the date of issuance to March 31 of each year and must be renewed annually. Sign up/log in to MyKingston to complete your application online and ensure we can fulfill your request effectively. Apply Now Application submission Checklist ",
    "pdfs": []
  },
  {
    "heading": "Monday to Sunday",
    "text": "",
    "pdfs": []
  },
  {
    "heading": "Important conditions of short-term rental operators",
    "text": "These rules apply to operators who receive payment for all or part of a Dwelling Unit, providing accommodations for a period equal to or less than 30 consecutive days: ",
    "pdfs": []
  },
  {
    "heading": "Frequently asked questions",
    "text": "Who can apply for a short-term rental operator licence? Only the owner of the property or the authorized agent of the owner may apply for a licence. The Owner's authorized agent means the person or persons appointed by the Owner to make decisions in relation to the Owner's property in their absence. If the Owner is a corporation or partnership, they have the authority to bind the Owner. Who is required to have a short-term rental operator licence? Any owner of a property within the city of Kingston who receives payment for all or part of a dwelling unit used to provide sleeping accommodations for a period equal to or less than 30 consecutive days. Where are short-term rentals allowed? Short-term rentals are allowed in Residential Dwelling Units, including single detached, semi-detached, row house, secondary suites in a single detached dwelling, or multi-unit buildings located within the city of Kingston as per Bylaw. What type of dwelling is considered a short-term rental A dwelling unit means a suite operated as a housekeeping unit, used or intended to be used by one or more persons and usually containing cooking, eating, living, sleeping and sanitary facilities. This definition applies to any dwelling unit in any type of building, including a single-detached, semi-detached or row house with a secondary suite within the principal building or a detached building on the same lot; as well as a seasonal dwelling unit (cabin/cottage). What types of buildings or spaces are ineligible for a short-term rental? What is considered a separate dwelling unit or secondary suite? A dwelling unit containing living/sleeping, eating and sanitary facilities that is completely separated from the principal dwelling unit by a fire separation and door that restricts entry between the two units would be considered a separate dwelling unit or secondary suite.  A bar area in a basement would not constitute a separate unit. Properties with an Additional Residential Unit must meet Building Code requirements. You may be required to provide a copy of the building permit obtained during construction of the unit. What should I do if the proposed short-term rental dwelling unit lacks a unit number? If your dwelling unit does not have a recognized unit number by the City and you have more than one unit in your building, it may not necessarily mean the unit is illegal.  Please contact building services at buildinginspection@cityofkingston.ca . We will check historic records to determine if the unit was legalized previously, however no unit number was assigned at that time. If this is the case, we will work with civic addressing to have the unit recognized and a unit number assigned. What can I do prior to my application submission to ensure approval? It is always good to confirm if the unit you will be renting is legal and there are no open permits on file that may extend the time for the short-term rental application to be approved.  Staff are available at buildinginspection@cityofkingston.ca to review information on file with you prior to your short-term license application submission to help with the process. How many people or bedrooms are allowed to licence my short-term rental? If you are renting the entire dwelling: If you are renting by the bedroom: Will I be notified if an agent wants to inspect my proposed short-term rental space? Any City staff wanting to inspect your property to confirm bylaw compliance will contact you and set up a time that is convenient. An agent cannot enter a dwelling unit without consent of the occupier, unless an order or warrant has been issued authorizing entry, or there is an immediate danger to the health and safety of persons. Refusal of consent to allow entry to a dwelling unit does not constitute hindering or obstruction under the Bylaw unless the City is acting under an order or warrant, noted above, under the Municipal Act. Must rural residents upgrade their septic systems to support short-term rentals? No, if your dwelling unit is existing and you are not adding any additional plumbing fixtures or living space to support the short-term rental use.  In certain instances, where an additional dwelling unit has been constructed without a permit, a building permit and zoning approvals would be required to utilize this space as a Dwelling Unit or Short-Term Rental.  In these circumstances, the septic system would need to be assessed to support any additional loads imposed. Are renovations required to my home to operate a short-term rental? In general, existing homes that are compliant with the Building Code and Zoning Bylaw would not require renovations or additional construction. If your existing unit was created legally under a building permit, no alterations would be required in order to operate your short-term rental. If you are considering renovations, such as finishing a basement, adding bedrooms or an additional Dwelling Unit including a secondary suite, in order to rent out the space, a building permit would be required. Are there fire safety regulations for my short-term rental? All existing dwelling units in Ontario, regardless if they are a short-term rental or not, are subject to the Fire Code which states: What do I do if I have a concern with my neighbour’s short-term rental? Please Contact Us to submit a complaint. The matter will be directed to the City’s Licensing and Bylaw Enforcement departments for investigation. All properties within the City of Kingston are subject to the minimum standards established by the Property Standards Bylaw, which manages and controls the way properties are maintained and used in the City of Kingston. The purpose of this bylaw is to set out standards for properties, so they are not an eyesore or nuisance to neighbours or affect the enjoyment of one’s own property. Properties are also subject to Parking Bylaw and Noise Bylaw and Solid Waste Bylaw, and all other applicable laws. Contact Us City of Kingston City Hall 216 Ontario Street Kingston, ON K7L 2Z3 Canada contactus@cityofkingston.ca Phone: 613-546-0000 The City of Kingston acknowledges that we are on the traditional homeland of the Anishinabek, Haudenosaunee, and the Huron-Wendat, and thanks these nations for their care and stewardship over this shared land. Today, the City is committed to working with Indigenous peoples and all residents to pursue a united path of reconciliation. Learn more about the City's reconciliation initiatives . ",
    "pdfs": []
  }
]