[
  {
    "heading": "Special Event and Park Permits",
    "text": "You need a permit if you are planning to hold an event in a City park or First Capital Place (Springer Market Square, Memorial Hall in City Hall, or Confederation Park). Depending on your event, you will need either a Special Event Permit or a one-time use Park Permit. We will determine which permit is required based on the information you provide in your application. All events must also have insurance. Before filling out the application form, please consider the following questions: ",
    "pdfs": []
  },
  {
    "heading": "Apply for a special event or park permit",
    "text": "Sign up/log in to MyKingston to complete your application online and ensure we can fulfill your request effectively. Require an alternate format? You can Contact Us . Apply Now To book another City facility like a pool or indoor recreation space, visit our Rentals page . ",
    "pdfs": []
  },
  {
    "heading": "Timelines",
    "text": "We recommend applying early in your event planning process. Planning large scale events can be complex, requiring permission from various City departments, as well as Public Health, provincial or federal regulators. The City’s Special Event Policy identifies parks, timelines and usage suitable for these events. For large and mega events (500-5000+ attendees per day) we recommend applying 12-18 months before your event. For smaller events and gatherings like picnics, photo shoots and field trips (less than 500 attendees per day), please apply at least 90 days prior to your event or park booking. ",
    "pdfs": []
  },
  {
    "heading": "Event fees",
    "text": "The following are key fees and charges related to special events. For the full list check the Fees and Charges Bylaw . Fees do not include HST. Taxes will be added at the time of payment. Other permits and fees may apply depending on the nature of your event (road closure permit, parking permit, etc.). Event rental rates Rental Type Duration Cost Special event park rental Half day $455.09 Special event park rental Full day $650.13 Large scale event park rental Half day $632.39 Large scale event park rental Full day $886.59 Mega event park rental Full day $1,144.82 Set-up/tear town Daily $295.53 Commercial surcharge on all rates Hourly 20% Mobile stage rental Item Duration Cost Mobile stage - SL100 Daily $7,845.13 Mobile stage - SL75 Daily $1,649.56 Stage monitoring Hourly $84.96 Deck extension or sound wing deck Hourly $151.24  ",
    "pdfs": []
  },
  {
    "heading": "Film permits",
    "text": "Film permits are separate from Special Event Permits and are managed by the Film & Media Office within Tourism Kingston. Permit applications can be found on the Visit Kingston website . Contact Special Events Office 216 Ontario St. Kingston, ON K7L 2Z3 specialeventsoffice @cityofkingston.ca Phone: 613-546-4291 ext. 1728/1801 The City of Kingston acknowledges that we are on the traditional homeland of the Anishinabek, Haudenosaunee, and the Huron-Wendat, and thanks these nations for their care and stewardship over this shared land. Today, the City is committed to working with Indigenous peoples and all residents to pursue a united path of reconciliation. Learn more about the City's reconciliation initiatives . ",
    "pdfs": []
  }
]