[
  {
    "heading": "Street Patio Program",
    "text": "Our street patio program provides outdoor dining options to businesses within public spaces, like sidewalks and on-street parking spaces. ",
    "pdfs": []
  },
  {
    "heading": "Patio types",
    "text": "There are two types of street patios: If you are interested in applying for a street patio in one of the configurations above, please review our Street Patio Standards and Application Guide in detail to learn more about the program. Application submission Checklist Note: The City reserves the right to deny a street patio application if the proposal does not meet the minimum requirements outlined in the Street Patio Standards and Application Guide or if there are specific issues with the proposed site that would preclude the installation of a street patio. Sign up/log in to MyKingston to complete your application online and ensure we can fulfill your request effectively. Apply now ",
    "pdfs": [
      {
        "text": "Street Patio Standards and Application Guide",
        "url": "https://www.cityofkingston.ca/media/s0lb0s3u/transportation_guide_streetpatiostandardsapplication.pdf"
      }
    ]
  },
  {
    "heading": "Winter patios",
    "text": "During the winter months, businesses can apply to operate winter patios. Café-style patio (tables and chairs only) are permitted to operate year-round, and must adhere to all of the requirements outlined in the Street Patio Standards and application guide. ",
    "pdfs": []
  },
  {
    "heading": "Add public seating",
    "text": "You can apply to add public seating in front of your business. This could consist of: Provide the product specifications for the benches or chairs and where you are planning to place them. There's a one-time application fee. For more information or to submit your request email transportation@cityofkingston.ca . Contact Us City of Kingston City Hall 216 Ontario Street Kingston, ON K7L 2Z3 Canada contactus@cityofkingston.ca Phone: 613-546-0000 The City of Kingston acknowledges that we are on the traditional homeland of the Anishinabek, Haudenosaunee, and the Huron-Wendat, and thanks these nations for their care and stewardship over this shared land. Today, the City is committed to working with Indigenous peoples and all residents to pursue a united path of reconciliation. Learn more about the City's reconciliation initiatives . ",
    "pdfs": []
  }
]